Repository: GNOME/gnome-builder
Catalog: po/*.po
Languages: ja, ru

source: Unit Test Output
ja: ユニットテスト出力
ru: Вывод модульных тестов

source: Clear test output
ja: テスト出力をクリア
ru: Очистить вывод теста

source: Cancel tests
ja: テストをキャンセル
ru: Отменить тесты

source: Save test output
ja: テスト出力を保存
ru: Сохранить вывод теста

source: Running all unit tests at %s
ja: すべてのユニットテストを %s に実行中

source: Unit tests completed in %lf seconds
ja: ユニットテストが %lf 秒で完了しました

source: Unit tests completed
ja: ユニットテストが完了しました

source: Run all Unit Tests
ja: 全ユニットテストを実行

source: Request that all unit tests are run
ja: すべてのユニットテストを実行するよう要求する

source: TODO/FIXMEs
ja: TODO/FIXME
ru: TODO/FIXME

source: Loading TODOs…
ja: TODO をロード中…
ru: Загрузка TODO…

source: Updating Dependencies…
ja: 依存関係を更新中…
ru: Обновление зависимостей…

source: Builder is updating your project’s configured dependencies.
ja: ビルダーがプロジェクトの設定済み依存関係を更新中です。

source: Update Dependencies…
ja: 依存関係を更新…

source: Download updates to project dependencies
ja: プロジェクトの依存関係のアップデートをダウンロードする

source: Updating Builder
ja: ビルダーを更新中
ru: Обновление Builder

source: Update Available
ja: アップデートが利用可能
ru: Доступно обновление

source: An update to Builder is available. Builder can download and install it for you.
ja: ビルダーのアップデートが利用可能です。ビルダーはあなたの代わりにアップデートをダウンロードし、インストールすることができます。
ru: Доступно обновление Builder. Builder может скачать и установить его.

source: _Update
ja: 更新(_U)
ru: _Обновить

source: Install Updates…
ja: アップデートをインストール…

source: Install pending updates for Builder
ja: ビルダーの保留中のアップデートをインストールする

source: Run with Leak Detector
ja: メモリリーク検出を有効にして実行

source: Run the project with valgrind
ja: Valgrind を使用してプロジェクトを実行

source: Leak Detector
ja: リーク検出

source: Track Origin of Leaks
ja: リーク元を追跡

source: Report Leaks
ja: リークを報告

source: Summary
ja: サマリー

source: Full
ja: 全文

source: Leak Kinds
ja: リークの種類

source: Definite
ja: 確実 (Definite)

source: Indirect
ja: 間接的 (Indirect)

source: Possible
ja: 可能性 (Possible)

source: Reachable
ja: 到達可能 (Reachable)

source: Include definite leaks in report summary
ja: レポートサマリーに確実なリークを含める

source: Include possible leaks in report summary
ja: レポートサマリーに可能性のあるリークを含める

source: Include indirect leaks in report summary
ja: レポートサマリーに間接的なリークを含める

source: Include reachable leaks in report summary
ja: レポートサマリーに到達可能なリークを含める

source: Track Origins
ja: 発生元を追跡

source: Show origin of undefined values
ja: 未定義の値の発生元を表示

source: Number of Callers
ja: 呼び出し元の数

source: Set the limit to the number of entries in stack traces
ja: スタックトレースのエントリ数の上限を設定する

source: Leak Check
ja: リークチェック

source: Search for memory leaks at exit
ja: 終了時にメモリリークを検索する

source: Begin cloning project from URI
ja: URI からプロジェクトのクローンを開始
ru: Начать клонирование проекта из URI

source: A failure occurred while cloning the repository.
ja: リポジトリのクローン作成に失敗しました。

source: Repository URL
ja: リポジトリ URL
ru: URL-адрес репозитория

source: Choose an alternate branch
ja: 別のブランチを選択する

source: Branches
ja: ブランチ
ru: Ветви

source: Enter the URL of the source code repository for the project you would like to clone.
ja: クローンしたいプロジェクトのソースコードリポジトリの URL を入力してください。

source: The repository will be cloned into a new subdirectory.
ja: リポジトリは新しいサブディレクトリにクローンされます。

source: Author Details
ja: 著者の詳細

source: You may specify authorship information to override defaults.
ja: 著者情報を指定することで、既定値を上書きできます。

source: Status
ja: 状態

source: _Branches
ja: ブランチ(_B)

source: _Tags
ja: タグ(_T)

source: _Switch to branch
ja: ブランチに切り替え(_S)
ru: _Переключиться на ветку

source: _Push to origin
ja: origin にプッシュ(_P)
ru: _Отправить в origin

source: Vim
ja: Vim テキストエディター

source: New _Browser Page
ja: 新しいブラウザページ(_B)

source: Open a web browser in a new page
ja: 新しいページでウェブブラウザを開く

source: Reload Page
ja: ページを再読み込み

source: Reload the current page
ja: 現在のページを再読み込み

source: Reload the current page ignoring cache
ja: 現在のページをキャッシュを無視して再読み込み

source: Focus Location
ja: フォーカス位置

source: Focus the current page's location
ja: 現在のページの位置にフォーカスする

source: _Web Browser
ja: ウェブブラウザ(_W)

source: Stop Loading
ja: 読み込みを停止

source: Reload
ja: 再読み込み

source: _Find in Page
ja: ページ内検索(_F)

source: Print
ja: 印刷

source: Enable _JavaScript
ja: JavaScript を許可(_J)

source: Failed to parse XML document
ja: XMLドキュメントの解析に失敗しました

source: Failed to create the XML tree.
ja: XMLツリーの作成に失敗しました。
ru: Не удалось создать дерево XML.

source: File must be saved locally to parse.
ja: 解析するには、ファイルをローカルに保存する必要があります。
ru: Файл должен быть сохранен локально для разбора.

source: An IDE for GNOME
ru: IDE для GNOME

source: Christian Hergert, et al.
ru: Кристиан Хергерт и др.

source: Debugger Breakpoint on Main
ru: Точка останова отладчика в основной функции

source: Debugger should automatically insert breakpoint on main function.
ru: Отладчик должен автоматически вставлять точку остановки в основную функцию.

source: Smart Home and End
ru: Умные кнопки Home и End

source: Whether or not Home moves to first non-space character.
ru: Будет ли клавиша «Home» перемещать к первому непробельному символу.

source: Show overview map
ru: Показывать обзорную карту

source: If enabled, Builder will display an overview map of the source file next to the editor.
ru: Если этот параметр включён, Builder будет отображать обзорную карту текущего файла рядом с редактором.

source: Automatically Hide Overview Map
ru: Автоматически Скрывать Обзорную Карту

source: If enabled, Builder will automatically hide the overview map when mouse focus leaves the editor, or a timeout occurs.
ru: Если этот параметр включён, Builder будет автоматически скрывать обзорную карту когда курсор мыши покидает редактор, или возникает таймаут.

source: Overscroll
ru: Прокрутка

source: The number of lines to scroll beyond the end of the buffer.
ru: Количество строк для прокрутки за пределами конца буфера.

source: Line Spacing
ru: Междустрочный интервал

source: The number of pixels to include above and below lines in the editor.
ru: Число пикселей над и под строками в редакторе.

source: Window position
ru: Положение окна

source: Window position (x and y).
ru: Положение окна (x ; y).

source: "Projects"
ru: Проекты

source: Restore Previous Files
ru: Восстановить предыдущие файлы

source: Restore previously opened files when loading a project.
ru: Восстановить предыдущие файлы при загрузке проекта.

source: Show Open Files
ru: Отображать открытые файлы

source: Display the open files list in the project sidebar.
ru: Отображать список открытых файлов в боковой панели проекта.

source: Show Left Panel
ru: Показывать левую панель

source: If enabled, the left panel will be displayed.
ru: Если этот параметр включён, будет отображаться левая панель.

source: Left Panel Position
ru: Позиция левой панели

source: The width in pixel units of the left panel.
ru: Ширина левой панели в пикселях.

source: Show Right Panel
ru: Показывать правую панель

source: If enabled, the right panel will be displayed.
ru: Если этот параметр включён, будет отображаться правая панель.

source: Right Panel Position
ru: Позиция правой панели

source: The width in pixel units of the right panel.
ru: Ширина правой панели в пикселях.

source: Show Bottom Panel
ru: Показывать нижнюю панель

source: If enabled, the bottom panel will be displayed.
ru: Если этот параметр включён, будет отображаться нижняя панель.

source: Bottom Panel Position
ru: Позиция нижней панели

source: The height in pixel units of the bottom panel.
ru: Высота нижней панели в пикселях.

source: D-Bus Inspector
ru: Инспектор D-Bus

source: Palette:
ru: Палитра:

source: Palette
ru: Палитра

source: Color Plane
ru: Цвет Границы

source: Color name
ru: Название цвета

source: Enter a new name for the color
ru: Введите новое название цвета

source: Unsaved palette %u
ru: Несохранённая палитра %u

source: failed to parse line %i
ru: не удалось разобрать строку %i

source: %s: palette is empty
ru: %s: палитра пуста

source: %s: failed to parse
ru: %s: не удалось проанализировать

source: Unable to open %s
ru: Невозможно открыть %s

source: %s: This file format is not supported
ru: %s: Данный формат файла не поддерживается

source: failed to parse
ru: не удалось обработать

source: Generated
ru: Сформирован

source: Unable to save %s
ru: Невозможно сохранить %s

source: Saturation
ru: Насыщенность

source: Color Components
ru: Компонеты цвета

source: Color strings
ru: Цвет строк

source: Palettes
ru: Палитры

source: No open palettes
ru: Нет открытых палитр

source: Load or generate a palette using the preferences
ru: Загрузите или создайте палитру используя параметры

source: Rename
ru: Переименовать

source: A suitable debugger was not found.
ru: Подходящий отладчик не был найден.

source: Failed to load file: %s
ru: Не удалось загрузить файл: %s

source: Failed to save file: %s
ru: Не удалось сохранить файл: %s

source: Cancel
ru: Отменить

source: Save a Copy
ru: Сохранить копию

source: Editor shortcuts
ru: Комбинации клавиш редактора

source: Save the document
ru: Сохранить документ

source: Save the document with a new name
ru: Сохранить документ с новым именем

source: Print the document
ru: Распечатать документ

source: Find and replace
ru: Найти и заменить

source: Find
ru: Найти

source: Move to the next match
ru: Переместить к следующему совпадению

source: Move to the previous match
ru: Переместить к предыдущему совпадению

source: Move to the next error
ru: Перейти к следующей ошибке

source: Move to the previous error
ru: Перейти к предыдущей ошибке

source: _Reload
ru: _Перезагрузить

source: Builder has discovered that this file has been modified externally. Would you like to reload the file?
ru: Builder обнаружил, что данный файл был изменен извне. Хотите перезагрузить его?

source: Regular expressions
ru: Регулярные выражения

source: Case sensitive
ru: Учитывать регистр

source: Match whole word only
ru: Только по слову целиком

source: Switch between Search and Search-and-Replace
ru: Переключение между поиском и поиском-и-заменой

source: Show or hide search options such as case sensitivity
ru: Показать или скрыть параметры поиска, такие как чувствительность к регистру

source: Regular _expressions
ru: Регулярные _выражения

source: _Case sensitive
ru: _Учитывать регистр

source: _Match whole word only
ru: _Только по слову целиком

source: Document Properties
ru: Свойства документа

source: Highlight Mode
ru: Режим подсветки

source: Display line numbers
ru: Показывать количество строк

source: Display relative line numbers
ru: Показывать относительные номера строк

source: Display right margin
ru: Показывать правую границу

source: Automatic indentation
ru: Автоматическая расстановка отступов

source: Smart backspace
ru: Умная кнопка Backspace

source: Enabling smart backspace will treat multiple spaces as a tabs
ru: Умная кнопка Backspace обрабатывает несколько пробелов как табуляцию

source: Insert trailing newline
ru: Вставлять завершающий перевод строки

source: Overwrite trailing braces and quotations
ru: Заменять закрывающиеся скобки и кавычки

source: Spaces per tab
ru: Пробелов в табуляции

source: Open Pages
ru: Открытые страницы

source: Create a new document
ru: Создать новый документ

source: Open a document
ru: Открыть документ

source: Toggle navigation panel
ru: Переключить панель навигации

source: Toggle utilities panel
ru: Переключить панель утилит

source: Close all files
ru: Закрыть все файлы

source: Editor
ru: Редактор

source: Restoring previous session
ru: Восстановление предыдущей сессии

source: Your previous session will be ready in a moment.
ru: Ваша предыдущая сессия будет готова через мгновение.

source: Switch surface
ru: Переключение перспективы

source: Search your project
ru: Поиск по проекту

source: Failed to locate runtime
ru: Не удалось найти исполняемую библиотеку

source: The build target failed to build: %s
ru: Ошибка построения цели сборки: %s

source: Workbench shortcuts
ru: Комбинации клавиш рабочего пространства

source: Build and Run
ru: Собрать и запустить

source: Failed to locate a build target
ru: Не удалось найти цель для сборки

source: Process quit unexpectedly
ru: Процесс неожиданно завершил работу

source: The directory “%s” already exists. Please choose another directory.
ru: Папка «%s» уже существует. Пожалуйста, выберите другую папку.

source: Your project will be created at %s
ru: Ваш проект будет создан в %s

source: Enter the repository of the project you would like to clone. The URL should look similar to “https://gitlab.gnome.org/GNOME/gnome-builder.git”.
ru: Введите адрес репозитория проекта, который вы хотите клонировать. URL должен выглядеть похоже на «https://gitlab.gnome.org/GNOME/gnome-builder.git».

source: Select branch and other options.
ru: Выбрать ветку и другие параметры.

source: Repository Kind
ru: Тип репозитория

source: Author Name
ru: Имя автора

source: Author Email
ru: Электронная почта автора

source: Project Destination
ru: Назначение проекта

source: Clone _Project
ru: Клонировать _проект

source: Removing project sources will delete them from your computer and cannot be undone.
ru: Удаление исходного кода проекта удалит его с вашего компьютера. Эту операцию нельзя отменить.

source: Delete Project Sources
ru: Удалить исходные файлы проектов

source: Go back
ru: Перейти назад

# title
source: Clone Repository
ru: Клонировать репозиторий

source: Switch Surface
ru: Переключение поверхности

source: Run Options
ru: Параметры выполнения

source: Learn more about GNOME Builder
ru: Узнайте больше о GNOME Builder

source: FILE
ru: ФАЙЛ

source: Show the help window
ru: Показать окно справки

source: Show the preferences window
ru: Показать окно настроек

source: Show the shortcuts window
ru: Показать окно комбинаций клавиш

source: GNOME Builder requires a session with D-Bus which was not found. Please set DBUS_SESSION_BUS_ADDRESS. Some features may not be available.
ru: GNOME Builder требует сеанса с D-Bus, который не был найден. Установите DBUS_SESSION_BUS_ADDRESS. Некоторые функции могут быть недоступны.

source: Command failed
ru: Сбой команды

source: Failed to locate command “%s”
ru: Не удалось найти команду «%s»

source: Project sidebar
ru: Боковая панель проекта

source: File chooser
ru: Диалог выбора файлов

source: New terminal
ru: Новый терминал

source: _New Terminal
ru: _Новый терминал

source: Move document to the right
ru: Передвинуть документ вправо

source: Move document to the left
ru: Передвинуть документ влево

source: Switch to the previous document
ru: Перейти к предыдущему документу

source: Switch to the next document
ru: Перейти к следующему документу

source: Close the document
ru: Закрыть документ

source: No Open Pages
ru: Нет открытых страниц

source: Uh oh, something went wrong
ru: Ой, что-то пошло не так

source: There was a failure while trying to perform the operation.
ru: Во время выполнения операции произошла ошибка.

source: Window shortcuts
ru: Комбинации клавиш окна

source: Show window menu
ru: Показать меню

source: Toggle window to fullscreen
ru: Развернуть окно на полный экран

source: Extensions
ru: Расширения

source: follow
ru: следовать

source: Grid Pattern
ru: Схема сетки

source: Font
ru: Шрифт

# Keywords
source: editor font monospace
ru: моноширинный шрифт редактора

source: Number of pixels above and below editor lines
ru: Число пикселей над и под строками редактора

# Keywords
source: editor line spacing font monospace
ru: редактор строка расстояние моноширинный шрифт

source: Color Scheme
ru: Цветовая схема

source: Keyboard
ru: Клавиатура

source: Emulation
ru: Эмуляция

source: Default keybinding mode which mimics gedit
ru: Режим привязки клавиш, по умолчанию имитирует gedit

source: Movement
ru: Перемещение

source: Home moves to first non-whitespace character
ru: Клавиша Home перемещает курсор к первому непробельному символу

source: Display list of open files
ru: Показать список открытых файлов

source: Display the list of all open files in the project sidebar
ru: Отображать список всех открытых файлов в боковой панели проекта

source: Reformat code on save
ru: Переформатировать код при сохранении

source: Reformat current file on save
ru: Переформатировать текущий файл при сохранении

source: Cursor
ru: Курсор

source: Restore cursor position
ru: Восстановить позицию курсора

source: Restore cursor position when a file is reopened
ru: Восстановить позицию курсора при повторном открытии файла

source: Scroll Offset
ru: Запас прокрутки

source: Minimum number of lines to keep above and below the cursor
ru: Минимальное количество строк, которое должно находиться над и под курсором

source: Allow the editor to scroll past the end of the buffer
ru: Разрешить редактору прокрутку дальше конца буфера

source: Text Wrapping
ru: Перенос текста

source: In Between Words
ru: Между словами

source: Line Information
ru: Строка состояния

source: Line numbers
ru: Номера строк

source: Show line number at beginning of each line
ru: Показывать номер в начале каждой строки

source: Relative line numbers
ru: Относительные номера строк

source: Show line numbers relative to the cursor line
ru: Показывать номера строк относительно текущей строки

source: Line changes
ru: Изменение строк

source: Show if a line was added or modified next to line number
ru: Показывать рядом с номером строки, добавление или изменение в строке

source: Line diagnostics
ru: Диагностика

source: Show an icon next to line numbers indicating type of diagnostic
ru: Показывать иконку рядом с номерами строк, показывающую тип диагностики

source: Highlight
ru: Подсветка

source: Current line
ru: Текущая строка

source: Make current line stand out with highlights
ru: Выделять текущую строку

source: Matching brackets
ru: Парные скобки

source: Highlight matching brackets based on cursor position
ru: Подсвечивать парные скобки на основании позиции курсора

source: Code Overview
ru: Обзор кода

source: A zoomed out view to enhance navigating source code
ru: Отдалить обзор для улучшения навигации по исходному коду

source: Automatically hide overview map
ru: Автоматически скрывать обзорную карту

source: Automatically hide map when editor loses focus
ru: Автоматически скрывать карту, когда редактор теряет фокус

source: Visible Whitespace Characters
ru: Отображение пробельных символов

source: New line and carriage return
ru: Новая линия и возврат каретки

source: Spaces inside of text
ru: Пробелы внутри текста

source: Trailing Only
ru: Только завершающий

source: Leading Only
ru: Только ведущий

source: Autosave
ru: Автосохранение

source: Enable or disable autosave feature
ru: Включить или выключить функцию автосохранения

source: The number of seconds after modification before auto saving
ru: Число секунд после внесения изменений перед автосохранением

source: Code Insight
ru: Анализ кода

source: Use code insight to highlight additional information discovered in source file
ru: Использовать анализ кода, чтобы подсветить дополнительную информацию, выявленную в исходном файле

source: Completion
ru: Автодополнение

source: Completions Display Size
ru: Размер окна автодополнений

source: Number of completions to display
ru: Число отображаемых вариантов автодополнений

source: Display code suggestions interactively as you type
ru: Отображать автодополнения интерактивно в процессе написания

source: Completion Providers
ru: Автодополнение

source: Search languages…
ru: Поиск языков…

source: Trim trailing whitespace
ru: Удаление завершающих пробельных символов

source: Upon saving, trailing whitespace from modified lines will be trimmed.
ru: При сохранении, завершающие пробельные символы в измененных строках будут удалены.

source: Overwrite closing braces
ru: Замена закрывающих скобок

source: Insert matching character for { [ ( or "
ru: Вставлять парные символы для { [ ( или "

source: Margins
ru: Границы

source: Show right margin
ru: Показывать правую границу

source: Right margin position
ru: Позиция правой границы

source: Position in spaces for the right margin
ru: Расстояние в пробелах до правой границы

source: Tab width
ru: Ширина табуляции

source: Width of a tab character in spaces
ru: Ширина табуляции в пробелах

source: Insert spaces instead of tabs
ru: Вставлять пробелы вместо табуляции

source: Prefer spaces over use of tabs
ru: Предпочитать пробелы использованию табуляции

source: Automatically indent
ru: Автоматический отступ

source: Indent source code as you type
ru: Делать отступ во время ввода

source: Spacing
ru: Пробелы

source: Prefer a space before colons
ru: Предпочитать пробел перед двоеточиями

source: Number of CPU
ru: Количество ЦПУ

source: Build
ru: Сборка

source: Build Workers
ru: Рабочие потоки сборки

source: Number of parallel build workers
ru: Число параллельных рабочих потоков сборки

source: Clear build log pane on rebuild
ru: Очистить панель журнала сборки при пересбоке

source: Clear build cache at startup
ru: Очищать кэш сборки при запуске

source: Expired caches will be purged when Builder is started
ru: Просроченные кэши будут очищены при запуске Builder

source: Network
ru: Сеть

source: Allow downloads over metered connections
ru: Разрешить загрузки по лимитным соединениям

source: Allow the use of metered network connections when automatically downloading dependencies
ru: Разрешить использование лимитных сетевых соединений для автоматической загрузки зависимостей

source: Insert Breakpoint at Start of Application
ru: Вставить точку останова в начале программы

source: Automatically stop execution at the start of the applications main function
ru: Автоматически останавливать выполнение при запуске основной функции приложения

source: Workspace
ru: Рабочее пространство

source: A place for all your projects
ru: Место для всех ваших проектов

source: Restore previously opened files
ru: Восстановить ранее открытые файлы

source: Builder is updating your projects configured dependencies.
ru: Builder обновляет зависимости вашего проекта.

source: The project cannot be run while the build pipeline is being set up
ru: Проект не может быть запущен во время настройки конвейера сборки

source: Change run options
ru: Изменить параметры выполнения

source: Workspace shortcuts
ru: Комбинации клавиш рабочего пространства

source: Focus to the global search entry
ru: Сфокусировать поле ввода глобального поиска

# shortcut window
source: Editor Shortcuts
ru: Редактор комбинаций клавиш

# shortcut window
source: General
ru: Основные

# shortcut window
source: Show help
ru: Показать справку

# shortcut window
source: Toggle primary menu
ru: Переключить основное меню

# shortcut window
source: Global Search
ru: Глобальный поиск

# shortcut window
source: Preferences
ru: Параметры

# shortcut window
source: Command Bar
ru: Панель Команд

# shortcut window
source: Terminal
ru: Терминал

# shortcut window
source: Terminal in Build Runtime
ru: Терминал в среде исполнения сборки

# shortcut window
source: Keyboard Shortcuts
ru: Комбинации клавиш

# shortcut window
source: Toggle Focus Mode
ru: Переключить режим фокусировки

# shortcut window
source: Panels
ru: Панели

# shortcut window
source: Toggle left panel
ru: Переключить левую панель

# shortcut window
source: Toggle bottom panel
ru: Переключить нижнюю панель

# shortcut window
source: Show Find in Project panel
ru: Показывать панель поиска в проекте

# shortcut window
source: Files
ru: Файлы

# shortcut window
source: Create new document
ru: Создать новый документ

# shortcut window
source: Open a document
ru: Открыть документ

# shortcut window
source: Save the document
ru: Сохранить документ

# shortcut window
source: Save a copy of the document
ru: Сохранить копию документ

# shortcut window
source: Save all documents
ru: Сохранить все документы

# shortcut window
source: Print the document
ru: Распечатать документ

# shortcut window
source: Close the document
ru: Закрыть документ

# shortcut window
source: Close all documents
ru: Закрыть все документы

# shortcut window
source: Switch to the next document
ru: Перейти к следующему документу
