Repository: GNOME/gnome-builder
Catalog: po/*.po
Languages: ja, ru

source: User requested application to run
ja: ユーザーがアプリケーションの実行をリクエストしました

source: User requested application to restart
ja: ユーザーがアプリケーションの再起動をリクエストしました

source: User requested application to run with tool “%s”
ja: ユーザーがツール “%s” を使用してアプリケーションの実行をリクエストしました

source: User requested application to stop
ja: ユーザーがアプリケーションの停止をリクエストしました

source: Forcing subprocess %s to exit
ja: サブプロセス「%s」を強制終了中

source: Sending signal %d to subprocess %s
ja: サブプロセス「%2$s」にシグナル %1$d を送信中

source: Discovered runtime “%s”
ja: ランタイム “%s” を検出しました

source: Removing runtime “%s”
ja: ランタイム “%s” を削除中

source: Host System
ja: ホストシステム
ru: Операционная система хоста

source: Default (Host operating system)
ja: 既定 (ホストオペレーティングシステム)
ru: По умолчанию (операционная система хоста)

source: _Clone Repository…
ja: リポジトリをクローン(_C)…
ru: _Клонировать репозиторий…

source: Close
ja: 閉じる
ru: Закрыть

source: Open a _Project…
ja: プロジェクトを開く(_P)…
ru: Открыть _проект

source: Open a new or existing project
ja: 新規または既存のプロジェクトを開く

source: Create a new project by cloning a repository
ja: リポジトリをクローンして新規プロジェクトを作成

source: Select a _Folder…
ja: フォルダーを選択(_F)…
ru: Выбрать папку…

source: Directory
ja: ディレクトリ
ru: Директория

source: Builder — %s
ja: ビルダー — %s

source: Failed to load the project
ja: プロジェクトの読み込みに失敗しました
ru: Не удалось загрузить проект

source: _Close
ja: 閉じる(_C)
ru: _Закрыть

source: Delete Project Sources?
ja: プロジェクトソースを削除しますか?

source: Deleting the project source code from your computer cannot be undone.
ja: コンピュータからプロジェクトのソースコードを削除すると、元に戻すことができません。

source: _Delete Project Sources
ja: プロジェクトのソースを削除(_D)

source: Select Project Folder
ja: プロジェクトフォルダーを選択
ru: Выбрать папку проекта

source: Select Project File
ja: プロジェクトファイルを選択
ru: Выбрать файл проекта

source: _Open
ja: 開く(_O)
ru: _Открыть

source: All Project Types
ja: すべてのプロジェクトタイプ
ru: Все типы проектов

# title
source: Open a Project
ja: プロジェクトを開く
ru: Открыть проект

source: Toggle selection mode
ja: 選択モードを切り替える

source: Search all Builder projects…
ja: すべてのビルダープロジェクトを検索…
ru: Искать все проекты Builder…

source: No Projects Found
ja: プロジェクトが見つかりません
ru: Проекты не найдены

source: _Remove Projects
ja: プロジェクトを削除(_R)
ru: _Удалить проекты

source: Remove Projects and Sources…
ja: プロジェクトとソースを削除…
ru: Удалить проект вместе с исходным кодом…

source: Cannot locate property %s in class %s
ja: クラス「%2$s」内にプロパティ「%1$s」が見つかりません

source: Failed to find property %s in %s
ja: 「%2$s」内にプロパティ「%1$s」が見つかりません

source: Failed to retrieve va_list value: %s
ja: va_list の値の取得に失敗しました: %s

source: File path is NULL
ja: ファイルパスが NULL です

source: Error converting UTF-8 filename to wide char
ja: UTF-8ファイル名のワイド文字変換に失敗しました

source: ILCreateFromPath() failed
ja: ILCreateFromPath() の呼び出しに失敗しました

source: Cannot convert “%s” into a valid NSURL.
ja: “%s” を有効な NSURL に変換できません。

source: Just now
ja: たった今

source: An hour ago
ja: 1時間前

source: Yesterday
ja: 昨日

source: About a year ago
ja: 約1年前

source: About %u year ago
ja: 約%u年前

source: _Install
ja: インストール(_I)
ru: _Установить

source: %u of %u
ja: 全 %2$u 件中 %1$u 件目
ru: %u из %u

source: Search
ja: 検索
ru: Поиск

source: Enter new shortcut to change <b>%s</b>.
ja: 新しいショートカットを入力して、<b>%s</b> を変更する。

source: _Set
ja: 設定(_S)

source: Press Escape to cancel or Backspace to disable.
ja: キャンセルするには Esc キーを、無効にするには Backspace キーを押してください。

source: Close Project
ja: プロジェクトを閉じる
ru: Закрыть проект

source: General
ja: 全般
ru: Основные

source: Change application preferences
ja: アプリケーションの設定を変更する

source: Find keyboard shortcuts
ja: キーボードショートカットを見つける

source: Get help with using Builder
ja: ビルダーの使い方に関するヘルプを表示する

source: Show information about Builder
ja: ビルダーの情報を表示する

source: Quit without saving changes
ja: 変更を保存せずに終了する

source: Web Browsing
ja: ウェブ閲覧

source: Terminal
ja: 端末
ru: Терминал

source: New Terminals
ja: 新しい端末

source: translator-credits
ja: 松澤二郎 <jmatsuzawa@gnome.org> Yuki Okushi <yokushi@gnome.org> Takayuki Kusano <https://tkusano.jp/> Makoto Sakaguchi <ycco34vx@gmail.com>
ru: Stas Solovey <whats_up@tut.by>, 2017 Ivan Molodetskikh <yalterz@gmail.com>, 2020 Ser-82-png <sw@atrus.ru>, 2022

source: Funded By
ja: 資金提供
ru: Финансируется

source: Show the application preferences
ja: アプリケーションの設定を表示
ru: Показать параметры приложения

source: Open project in new workbench
ja: 新しいワークベンチでプロジェクトを開く
ru: Открыть проект в новом рабочем пространстве

source: Print version information and exit
ja: バージョン情報を表示して終了
ru: Напечатать информацию о версии и выйти

source: Increase log verbosity (may be repeated)
ja: ログの詳細度を上げる（複数回指定可能）
ru: Увеличение детализации журнала (может повторяться)

source: Failed to open project: %s
ja: プロジェクトを開くのに失敗しました: %s
ru: Не удалось открыть проект: %s

source: Remove environment variable
ja: 環境変数を削除
ru: Удалить переменную окружения

source: New variable…
ja: 新しい変数…
ru: Новая переменная…

source: Open a File or Terminal
ja: ファイルまたは端末を開く
ru: Открыть файл или терминал

source: Use the page switcher above or use one of the following:
ja: 上部のページ切り替えを使用するか、以下のいずれかを使用してください:
ru: Используйте переключатель страниц сверху или одну из следующих команд:

source: Project Sidebar
ja: プロジェクトのサイドバー

source: Open File
ja: ファイルを開く
ru: Открыть файл

source: New Terminal
ja: 新しい端末

source: Open application menu (F10)
ja: アプリケーションメニューを開く (F10)

source: Cannot load HTML. Missing WebKit support.
ja: HTML を読み込むことができません。WebKit のサポートがありません。
ru: Не удается загрузить HTML. Отсутствует поддержка WebKit.

source: Invalid configuration
ja: 無効な構成

source: Toggle Left Panel (F9)
ja: 左側パネルを切り替える (F9)

source: Toggle Right Panel
ja: 右側パネルを切り替える

source: Run Project (Shift+Ctrl+Space)
ja: プロジェクトを実行 (Shift+Ctrl+Space)

source: Stop Running Project
ja: 実行中のプロジェクトを停止

source: Stop running
ja: 実行を停止
ru: Остановить выполнение

source: Run project
ja: プロジェクトを実行

source: Search for anything
ja: 何でも検索

source: Type to Search
ja: 入力して検索

source: Prefix your query with one of the following to filter results
ja: 検索結果を絞り込むには、検索クエリの先頭に以下のいずれかを付けてください

source: Files
ja: ファイル
ru: Файлы

source: Symbols
ja: シンボル
ru: Символы

source: Documentation
ja: ドキュメント
ru: Документация

source: Actions
ja: アクション

source: Other
ja: その他
ru: Другой

source: Project loaded
ja: プロジェクトが読み込まれました

source: Loading project “%s”
ja: プロジェクト “%s” を読み込み中

source: Open
ja: 開く
ru: Открыть

source: There are unsaved documents
ja: 保存されていないのドキュメントがあります

source: Appearance
ja: 外観
ru: Внешний вид

source: Configurations
ja: 構成

source: Plugins
ja: プラグイン

source: Installing %u package
ja: パッケージを %u 個インストール中
ru: Устанавливается %u пакет

source: The operation has been cancelled
ja: 操作がキャンセルされました

source: Failed to initialize language server: %s
ja: 言語サーバーの初期化に失敗しました: %s
ru: Не удалось инициализировать сервер языковой поддержки: %s

source: No connection to language server
ja: 言語サーバーに接続できません

source: No LSP client connection is available
ja: LSP クライアント接続が利用できません

source: Language server “%s” exited
ja: 言語サーバー “%s” が終了しました

source: Language server “%s” spawned as process %s
ja: 言語サーバー “%s” がプロセス %s として起動されました

source: Authors
ja: 作者

source: Version
ja: バージョン

source: Website
ja: ウェブサイト

source: Version Control
ja: バージョン管理
ru: Контроль версий

source: SDKs
ja: SDK

source: Language Servers
ja: 言語サーバー

source: Devices & Simulators
ja: デバイスとシミュレーター

source: Diagnostics
ja: 診断
ru: Диагностика

source: Build Systems
ja: ビルドシステム

source: Compilers
ja: コンパイラー

source: Debuggers
ja: デバッガー

source: Templates
ja: テンプレート

source: Editing & Formatting
ja: 編集とフォーマット

source: Language Enablement
ja: 言語の有効化

source: Desktop Integration
ja: デスクトップ統合

source: Additional
ja: 追加

source: Destination file must be within the project tree.
ja: 宛先ファイルはプロジェクトツリー内に存在する必要があります。
ru: Файл назначения должен находиться в пределах дерева проекта.

source: File must be within the project tree.
ja: ファイルはプロジェクトツリー内に存在する必要があります。
ru: Файл должен быть в дереве проекта.

source: Could not parse XML from stream
ja: ストリームから XML を解析できませんでした
ru: Невозможно обработать XML из потока

source: Clipboard
ja: クリップボード

source: C_ut (Ctrl+X)
ja: 切り取り(_U) (Ctrl+X)

source: _Copy (Ctrl+C)
ja: コピー(_C) (Ctrl+C)

source: _Paste (Ctrl+V)
ja: 貼り付け(_P) (Ctrl+V)

source: Undo
ja: 元に戻す
ru: Отменить

source: Undo & Redo
ja: 元に戻す & やり直す

source: Undo (Ctrl+Z)
ja: 元に戻す (Ctrl+Z)

source: Redo (Shift+Ctrl+Z)
ja: やり直す (Shift+Ctrl+Z)

source: Zoom
ja: ズーム

source: Zoom Out (Ctrl+-)
ja: 縮小 (Ctrl+-)

source: Reset Zoom (Ctrl+0)
ja: ズームをリセット (Ctrl+0)

source: Zoom In (Ctrl++)
ja: 拡大 (Ctrl++)

source: Insert Emoji
ja: 絵文字の挿入

source: _Selection
ja: 選択(_S)
ru: _Выделение

source: Select _All
ja: すべて選択(_A)
ru: В_ыбрать все

source: Formatting
ja: フォーマット

source: All _Upper Case
ja: すべて大文字(_U)
ru: Все в верхн_ий регистр

source: Convert the text selection to upper case
ja: 選択したテキストを大文字に変換する

source: All _Lower Case
ja: すべて小文字(L)
ru: Все в ни_жний регистр

source: Convert the text selection to lower case
ja: 選択したテキストを小文字に変換する

source: In_vert Case
ja: 大文字/小文字を入れ替え(_V)
ru: И_нвертировать регистр

source: Invert case of the text selection
ja: 選択したテキストの大文字と小文字を反転する

source: _Title Case
ja: タイトルケース(_T)
ru: Прописная в на_чале каждого слова

source: Convert the text selection to title case
ja: 選択したテキストをタイトルケースに変換する

source: Select _Line
ja: 行の選択(_L)

source: _Delete Line
ja: 行の削除(_D)

source: _Join Lines
ja: 行の結合(_J)
ru: _Объединить строки

source: S_ort Lines
ja: 行を並べ替え(_O)
ru: С_ортировать строки

source: D_uplicate Line
ja: 行の複製(_U)

source: _Formatting
ja: フォーマット(_F)

source: Code Navigation
ja: コードナビゲーション

source: Ln %u, Col %u
ja: 行 %u、列 %u

source: Ln %u, Col %u (Sel: %u)
ja: 行 %u、列 %u (選択: %u 文字)

source: _Open Link
ja: リンクを開く(_O)
ru: _Открыть ссылку

source: _Copy
ja: コピー(_C)
ru: _Копировать

source: Copy selection from terminal to clipboard
ja: 端末から選択したテキストをクリップボードにコピーする

source: _Copy Link
ja: リンクをコピー(_C)

source: _Paste
ja: 貼り付け(_P)
ru: Вст_авить

source: Paste from clipboard into the terminal
ja: クリップボードの内容を端末に貼り付ける

source: Selection all text from terminal including scrollback
ja: 端末からスクロールバックを含めてすべてのテキストを選択する

source: Select _None
ja: 選択解除(_N)
ru: Отменить вы_бор

source: Save Terminal Content As
ja: 端末の内容を保存
ru: Сохранить содержимое терминала как

source: Save
ja: 保存
ru: Сохранить

source: Failed to launch subprocess. You may need to rebuild your project.
ja: サブプロセスの起動に失敗しました。プロジェクトを再構築する必要があるかもしれません。
ru: Не удалось запустить подпроцесс. Возможно, вам придется пересобрать свой проект.

source: Untitled terminal
ja: 無名の端末
ru: Безымянный терминал

source: Exited
ja: 終了
ru: Завершён

source: Subprocess launcher failed too quickly, will not respawn.
ja: サブプロセスの起動に失敗しました。あまりにも早く失敗したため、再起動は行われません。
ru: Программа запуска подпроцессов завершилась с ошибкой слишком быстро и не будет перезапущена.

source: Untitled Terminal
ja: 無名の端末
ru: Безымянный терминал

source: Clone of Ubuntu
ja: Ubuntu のクローン

source: Search runtimes
ja: ランタイムを検索
ru: Поиск сред выполнения

source: Move to previous match
ja: 前の一致箇所へ移動する

source: Move to next match
ja: 次の一致箇所へ移動する

source: Wrap around
ja: 折り返す
ru: Обратный поиск

source: Copied to clipboard
ja: クリップボードにコピーしました

source: Allow Input
ja: 入力を許可

source: Search…
ja: 検索…

source: Reset
ja: リセット

source: Reset and Clear
ja: リセットしてクリア

source: Process terminated by signal %d
ja: プロセスがシグナル %d で終了しました

source: <i>Loading</i>
ja: <i>読み込み中</i>

source: Empty
ja: 空

source: Projects Directory
ja: プロジェクトディレクトリ

source: Select
ja: 選択

source: Select Font
ja: フォントを選択

source: Builder — %s — Preferences
ja: ビルダー — %s — 設定

source: Builder — Preferences
ja: Builder — 設定
ru: Builder — Параметры

source: unversioned
ja: バージョン管理されていない
ru: без версии

source: None
ja: なし
ru: Нет

source: Blank page
ja: 空白ページ

source: Run a new instance of Builder
ja: ビルダーの新しいインスタンスを実行
ru: Запустить новый экземпляр Builder

source: Installing Arduino Library
ja: Arduinoライブラリをインストール中

source: Downloading and installing
ja: ダウンロードおよびインストール中

source: Uninstalling Arduino Library
ja: Arduinoライブラリをアンインストール中

source: Uninstalling
ja: アンインストール中

source: Installing Arduino Platform
ja: Arduinoプラットフォームをインストール中

source: Uninstalling Arduino Platform
ja: Arduinoプラットフォームをアンインストール中

source: Board Settings
ja: ボード設定

source: Board
ja: ボード

source: Programmer
ja: プログラマー

source: Libraries
ja: ライブラリ
ru: Библиотеки

source: No libraries are present in this profile
ja: このプロファイルにはライブラリがありません

source: Add _Library
ja: ライブラリを追加(_L)

source: No libraries installed
ja: ライブラリがインストールされていません

source: Install _Library
ja: ライブラリをインストール(_L)

source: Search for a Library
ja: ライブラリを検索

source: No libraries found
ja: ライブラリが見つかりません

source: Update Arduino Packages
ja: Arduinoパッケージを更新

source: Compile Arduino Sketch
ja: Arduinoスケッチをコンパイル

source: Upload Arduino Sketch
ja: Arduinoスケッチをアップロード

source: Remove
ja: 削除
ru: Удалить

source: Platforms
ja: プラットフォーム

source: No platforms are present in this profile
ja: このプロファイルにはプラットフォームがありません

source: Add _Platform
ja: プラットフォームを追加(_P)

source: No platforms installed
ja: プラットフォームがインストールされていません

source: Install _Platform
ja: プラットフォームをインストール(_P)

source: Search for a Platform
ja: プラットフォームを検索

source: No platforms found
ja: プラットフォームが見つかりません

source: Arduino Sketch Project
ja: Arduinoスケッチプロジェクト

source: An empty arduino sketch project
ja: 空のArduinoスケッチプロジェクト

source: Notes
ja: ノート

source: No additional URL
ja: 追加のURLがありません

source: Add URL
ja: URLを追加

source: _Add
ja: 追加(_A)

source: Additional URLs
ja: 追加のURL

source: Installed Libraries
ja: インストール済みライブラリ

source: Installed Platforms
ja: インストール済みプラットフォーム

source: Building cache…
ja: キャッシュを構築中…
ru: Построение кэша…

source: Bootstrapping build system
ja: ビルドシステムをブートストラップ中
ru: Операционная система хоста

source: Configuring project
ja: プロジェクトを構成中
ru: Настройка проекта

source: Building project
ja: プロジェクトをビルド中
ru: Проект собирается

source: Caching build commands
ja: ビルドコマンドをキャッシュ中
ru: Кэширование команд сборки

source: %s (Copy)
ja: %s (コピー)
ru: %s (копия)

source: BuildStream project in use but “bst” executable could not be found.
ja: BuildStream プロジェクトを使用中ですが、“bst” 実行可能ファイルが見つかりません。

source: Use KEY=VALUE to set an environment variable
ja: 環境変数の設定には、KEY=VALUE形式を使用

source: Keys may not start with a number
ja: キーは数字で始めることはできません

source: Keys may only contain alpha-numerics or underline.
ja: キーには英数字またはアンダースコア以外の文字を含めることはできません。

source: Add _Variable
ja: 変数を追加(_V)

source: Add Variable
ja: 変数を追加

source: Copy
ja: コピー
ru: Копировать

source: Build Output
ja: ビルド出力
ru: Вывод результата сборки

source: Build Output (Shift+Ctrl+L)
ja: ビルド出力 (Shift+Ctrl+L)

source: Clear build log
ja: ビルドログをクリア
ru: Очистить журнал сборки

source: Cancel build
ja: ビルドをキャンセル
ru: Отменить сборку

source: Save build log
ja: ビルドログを保存
ru: Сохранить журнал сборки

source: Missing
ja: 欠落
ru: Отсутствует

source: Branch
ja: ブランチ
ru: Ветка

source: Build Profile
ja: ビルドプロファイル
ru: Профиль сборки

source: Runtime
ja: ランタイム
ru: Исполняемая библиотека

source: Device
ja: デバイス
ru: Устройство

source: There is a problem with the current build configuration.
ja: 現在のビルド構成に問題があります。
ru: Проблема с текущей конфигурацией сборки.

source: Build status
ja: ビルドステータス
ru: Состояние сборки

source: Last build
ja: 前回のビルド
ru: Последняя сборка

source: Build result
ja: ビルド結果
ru: Результат сборки

source: Errors
ja: エラー
ru: Ошибки

source: Warnings
ja: 警告
ru: Предупреждения

source: Build Pipeline
ja: ビルドパイプライン

source: Build Issues
ja: ビルドの問題
ru: Проблемы сборки

source: Build status:
ja: ビルドステータス:
ru: Состояние сборки:

source: Time completed:
ja: 完了時刻:
ru: Время завершения:

source: Warnings (%u)
ja: 警告 (%u)

source: Errors (%u)
ja: エラー (%u)

source: Shared
ja: 共有

source: Static
ja: 静的

source: Executable
ja: 実行可能

source: Failed to list build targets: %s
ja: ビルドターゲットをリストするのに失敗しました: %s

source: Select Build Target
ja: ビルドターゲットの選択

source: Available Build Targets
ja: 利用可能なビルドターゲット

source: Some targets may not be available until the project has been configured.
ja: 一部のビルドターゲットは、プロジェクトが構成されるまで利用できない場合があります。

source: Automatically Discover
ja: 自動検出

source: This selection allows Builder to choose the best candidate.
ja: この選択により、ビルダーは最適な候補を選ぶことができます。

source: The container used to build and run your application
ja: アプリケーションのビルドと実行に使用されるコンテナ

source: Duplicate
ja: 複製

source: Duplicate into new configuration
ja: 新しい構成として複製する

source: Make Active
ja: アクティブにする

source: Make configuration active and reload build pipeline
ja: ビルド構成を有効にして、ビルドパイプラインを再読み込みする

source: Delete
ja: 削除
ru: Удалить

source: Delete configuration
ja: 構成を削除する

source: Stop Building Project (Shift+Ctrl+Alt+C)
ja: プロジェクトのビルドを停止 (Shift+Ctrl+Alt+C)

source: Build Project (Shift+Ctrl+Alt+B)
ja: プロジェクトをビルド (Shift+Ctrl+Alt+B)

source: Display Build Diagnostics (Ctrl+Alt+?)
ja: ビルドの診断を表示 (Ctrl+Alt+?)

source: Configure Project…
ja: プロジェクトを構成…

source: Configure settings related to the project
ja: プロジェクトに関連した設定を構成する

source: Code Foundry
ja: コードファウンドリー

source: Configuration
ja: 構成

source: Reload Configuration
ja: 構成を再読込

source: Reload project configuration
ja: プロジェクトの構成を再読み込み

source: Select Build Target…
ja: ビルドターゲットを選択…

source: Change default build target
ja: デフォルトのビルドターゲットを変更

source: Building
ja: ビルド中

source: _Build
ja: ビルド(_B)
ru: С_обрать

source: Build the project
ja: プロジェクトをビルド
ru: Собрать проект

source: _Rebuild
ja: 再ビルド(_R)
ru: П_ересобрать

source: Rebuild the project
ja: プロジェクトを再ビルド

source: _Clean
ja: クリーン(_C)
ru: _Очистить

source: Clean the project
ja: プロジェクトをクリーン

source: Stop Building
ja: ビルドを停止

source: Cancel the current build operation
ja: 現在のビルド操作をキャンセル

source: Install & Deployment
ja: インストールとデプロイ

source: Install the project
ja: プロジェクトをインストール

source: Deploy to Device…
ja: デバイスへデプロイ…

source: Deploy project to current device
ja: プロジェクトを現在のデバイスにデプロイ

source: _Export
ja: エクスポート(_E)

source: Export project
ja: プロジェクトをエクスポート

source: Show Bui_ld Output
ja: ビルド出力を表示(_L)

source: Display panel containing the build log
ja: ビルドログを含むパネルを表示

source: Running
ja: 実行中

source: Select Run Command…
ja: 実行コマンドを選択…

source: Run
ja: 実行
ru: Выполнить

source: Run the project
ja: プロジェクトを実行

source: Restart Program
ja: プログラムを再起動

source: Restart the running program
ja: 実行中のプログラムを再起動

source: Stop Program
ja: プログラムを停止

source: Stop running the project
ja: 実行中のプロジェクトを停止

source: Debugging
ja: デバッグ

source: Unit Tests
ja: ユニットテスト
ru: Модульные тесты

source: Settings
ja: 設定

source: Follow System Style
ja: システムスタイルに従う

source: Follow the system style when running the project
ja: プロジェクト実行時はシステムスタイルに従う

source: Force Light
ja: ライトテーマを強制

source: Force light theme when running the project
ja: プロジェクト実行時にライトテーマを強制する

source: Force Dark
ja: ダークテーマを強制

source: Force dark theme when running the project
ja: プロジェクト実行時にダークテーマを強制する

source: Accent Color
ja: アクセントカラー

source: System
ja: システム
ru: Система

source: Use system accent color when running the project
ja: プロジェクト実行時にシステムアクセントカラーを使用する

source: Blue
ja: ブルー
ru: Синий

source: Use blue accent color when running the project
ja: プロジェクト実行時にブルーアクセントカラーを使用する

source: Teal
ja: ティール

source: Use teal accent color when running the project
ja: プロジェクト実行時にティールアクセントカラーを使用する

source: Green
ja: グリーン
ru: Зеленый

source: Use green accent color when running the project
ja: プロジェクト実行時にグリーンアクセントカラーを使用する

source: Yellow
ja: イエロー

source: Use yellow accent color when running the project
ja: プロジェクト実行時にイエローアクセントカラーを使用する

source: Orange
ja: オレンジ

source: Use orange accent color when running the project
ja: プロジェクト実行時にオレンジアクセントカラーを使用する

source: Red
ja: レッド
ru: Красный

source: Use red accent color when running the project
ja: プロジェクト実行時にレッドアクセントカラーを使用する

source: Pink
ja: ピンク

source: Use pink accent color when running the project
ja: プロジェクト実行時にピンクアクセントカラーを使用する

source: Purple
ja: パープル

source: Use purple accent color when running the project
ja: プロジェクト実行時にパープルアクセントカラーを使用する

source: Slate
ja: スレート

source: Use slate accent color when running the project
ja: プロジェクト実行時にスレートアクセントカラーを使用する

source: Accessibility
ja: アクセシビリティ

source: High Contrast
ja: ハイコントラスト

source: Use high contrast theme when running the project
ja: プロジェクト実行時にハイコントラストテーマを使用

source: Adaptive Preview
ja: アダプティブプレビュー

source: Start the app in adaptive preview
ja: アダプティブプレビューでアプリを起動

source: Text Direction
ja: テキストの方向

source: Left-to-Right
ja: 左から右

source: Force left-to-right text when running the project
ja: プロジェクト実行時に左から右へのテキストを強制する

source: Right-to-Left
ja: 右から左

source: Force right-to-left text when running the project
ja: プロジェクト実行時に右から左へのテキストを強制する

source: GTK Renderer
ja: GTKレンダラー

source: Default
ja: デフォルト
ru: По умолчанию

source: Use the default GTK renderer when running the project
ja: プロジェクト実行時にデフォルトのGTKレンダラーを使用する

source: Use the Vulkan renderer when running the project
ja: プロジェクト実行時にVulkanレンダラーを使用する

source: Use the GL renderer when running the project
ja: プロジェクト実行時にGLレンダラーを使用する

source: Legacy GL
ja: レガシーGL

source: Use the legacy GL renderer when running the project
ja: プロジェクト実行時にレガシーGLレンダラーを使用する

source: Use the Cairo software renderer when running the project
ja: プロジェクト実行時にCairoソフトウェアレンダラーを使用する

source: Request verbose logging when running the project
ja: プロジェクト実行時に詳細ログを要求する

source: Show Inspector
ja: インスペクターを表示

source: Request the GTK inspector be shown when running the project
ja: プロジェクト実行時にGTKインスペクターの表示を要求する

source: Style
ja: スタイル
ru: Стиль

source: Interface
ja: インターフェイス
ru: Интерфейс

source: Editor Font
ja: エディターフォント

source: The font used in the source code editor
ja: ソースコードエディターで使用されるフォント

source: Terminal Font
ja: 端末のフォント
ru: Шрифт терминала

source: The font used in the terminal
ja: 端末で使用されるフォント

source: Show Grid Pattern
ja: グリッドパターンを表示

source: Display a grid pattern underneath source code
ja: ソースコードの下にグリッドパターンを表示
ru: Отображать схему сетки под исходным кодом

source: Never
ja: しない
ru: Никогда

source: Overview map is never displayed
ja: 概要マップは表示されない

source: Always
ja: 常に
ru: Всегда

source: Overview map is always displayed
ja: 概要マップは常に表示される

source: Auto
ja: 自動

source: Overview map is automatically displayed based on user input
ja: 概要マップはユーザー入力に基づいて自動的に表示される

source: Navigate with Tabs
ja: タブでナビゲート

source: Switch documents using a tabbed interface
ja: タブ付きインターフェースでドキュメントを切り替える

source: Navigate with Popover
ja: ポップオーバーでナビゲート

source: Switch documents using a popover
ja: ポップオーバーでドキュメントを切り替える

source: Commands
ja: コマンド

source: Run Command
ja: 実行コマンド

source: This command is used to run your project
ja: このコマンドはプロジェクトを実行するために使用される

source: Starting & Stopping
ja: 実行&停止

source: Install Before Running
ja: 実行前にインストール

source: Installs the application before running. This is necessary for most projects unless custom run commands are used.
ja: 実行前にアプリケーションをインストールする。これは、カスタム実行コマンドを使用する場合を除き、ほとんどのプロジェクトで必要です。

source: Stop Signal
ja: 停止シグナル

source: Send the signal to the target application when requesting the application stop.
ja: アプリケーションに停止を要求するときにターゲットにシグナルを送信する。

source: Logging
ja: ロギング

source: Runs with <tt>G_MESSAGES_DEBUG=all</tt> environment variable for troubleshooting
ja: トラブルシューティングのために環境変数 <tt>G_MESSAGES_DEBUG=all</tt> を設定して実行する

source: Run unit tests from within the build environment.
ja: ビルド環境内でユニットテストを実行する。

source: As Application
ja: アプリケーションとして

source: Run unit with access to display and other runtime environment features.
ja: ディスプレイやその他の実行時環境機能へのアクセスを有しながら、ユニットテストを実行する。

source: Build & Tooling
ja: ビルド&ツール

source: Storage
ja: ストレージ

source: Artifacts and Cached Files
ja: 成果物およびキャッシュファイル

source: Directory used for storing build artifacts and cached files from the build pipeline. Requires restarting Builder to take effect.
ja: ビルドパイプラインで生成された成果物およびキャッシュファイルを保存するディレクトリ。設定を有効にするには、ビルダーの再起動が必要です。

source: History
ja: 履歴

source: Clear Expired Artifacts
ja: 期限切れの成果物を削除

source: Artifacts which have expired will be deleted when Builder is started
ja: 期限切れの成果物は、ビルダーの起動時に削除される

source: Clear Build Logs
ja: ビルドログをクリア

source: Clear the build log history when a new build begins
ja: 新規ビルドの開始時にビルドログをクリアする

source: Show Build Logs
ja: ビルドログを表示

source: Show the build log when a new build begins
ja: 新規ビルドの開始時にビルドログを表示する
