Repository: GNOME/gnome-builder
Catalog: po/*.po
Languages: ja, ru

source: GNOME Builder
ja: GNOME ビルダー

source: User
ja: ユーザー

source: GCC %s Cross-Compiler (System)
ja: GCC %s クロスコンパイラ (システム)
ru: GCC %s кросс-компилятор (системный)

source: Original error: %s
ja: 元のエラー: %s

source: No repository to access file contents
ja: ファイルの内容にアクセスするためのリポジトリがありません
ru: Нет репозитория для доступа к содержимому файла

source: No contents have been set to diff
ja: 差分対象の内容が設定されていません
ru: Не установлено содержимое для сравнения

source: The operation failed. The original error was "%s"
ja: 操作に失敗しました。元のエラーは "%s" でした
ru: Операция завершилась неудачно. Исходная ошибка: «%s»

source: Builder failed to provide appropriate credentials when cloning the repository.
ja: ビルダーはリポジトリのクローン作成時に適切な認証情報を提供できませんでした。
ru: Builder не смог предоставить подходящую учётную запись при клонировании репозитория.

source: Cannot set AMEND and GPG_SIGN flags
ja: AMEND および GPG_SIGN フラグを設定できません
ru: Нельзя выставить флаги AMEND и GPG_SIGN

source: Cannot sign commit without GPG_KEY_ID
ja: GPG_KEY_ID が指定されていないため、コミットに署名できません
ru: Нельзя подписать коммит без GPG_KEY_ID

source: in the future
ja: 今後

source: just now
ja: たった今

source: %ld minute ago
ja: %ld 分前

source: %ld hour ago
ja: %ld 時間前

source: %ld day ago
ja: %ld 日前

source: %ld week ago
ja: %ld 週間前

source: %ld month ago
ja: %ld か月前

source: %ld year ago
ja: %ld 年前

source: Cannot monitor files outside the working directory
ja: 作業ディレクトリ外のファイルを監視できません
ru: Нельзя отслеживать изменения файлов вне рабочей директории

source: Git integration has started as process %s
ja: Git 統合がプロセス %s として開始されました

source: Git integration has exited
ja: Git 統合が終了しました

source: Git version control is not in use
ja: Git バージョン管理が使用されていません
ru: Система контроля версий Git не используется

source: Updating Git Submodules
ja: Git サブモジュールを更新中
ru: Обновление подмодулей Git

source: Initialize git submodules
ja: Git サブモジュールを初期化中
ru: Инициализация подмодулей Git

source: Network is not available, skipping submodule update
ja: ネットワークが利用できないため、サブモジュールの更新をスキップします
ru: Сеть недоступна, пропуск обновления подмодулей

source: A repository could not be found at “%s”.
ja: “%s” にリポジトリが見つかりませんでした。
ru: Не найден репозиторий по адресу «%s».

source: The protocol “%s” is not supported.
ja: プロトコル “%s” はサポートされていません。
ru: Протокол «%s» не поддерживается.

source: Cloning repository
ja: リポジトリをクローン中
ru: Клонировать репозиторий

source: A valid Git URL is required
ja: 有効な Git URL を指定してください
ru: Требуется корректный URL-адрес Git

source: Pushed.
ja: プッシュしました。
ru: Отправка завершена.

source: Pushing ref “%s”
ja: リファレンス “%s” をプッシュ中
ru: Отправка ссылки «%s»

source: Directory is not within repository
ja: ディレクトリはリポジトリ内にありません
ru: Директория не является частью репозитория

source: Show Inline Git Blame
ja: インライン Git Blame を表示

source: Authorship
ja: 著者情報

source: Email
ja: メールアドレス

source: Bootstrapping project
ja: プロジェクトをブートストラップ中
ru: Начальная настройка проекта…

source: Display a new greeter window
ja: 新しいグリーティングウィンドウを表示中
ru: Отобразить новое окно приветствия

source: Match
ja: 一致
ru: Результат

source: Path
ja: パス
ru: Путь

source: _Find in %s
ja: %s 内を検索(_F)
ru: _Найти в %s

source: _Replace in %s
ja: %s 内を置換(_R)
ru: _Заменить на %s

source: Find in Project
ja: プロジェクト内を検索

source: Replace in Project
ja: プロジェクト内を置換

source: Find in Files
ja: ファイル内を検索
ru: Найти в файлах

source: Find in Files (Shift+Ctrl+Alt+F)
ja: ファイル内を検索 (Shift+Ctrl+Alt+F)

source: _Recurse into Directories
ja: ディレクトリを再帰的に検索(_R)

source: Match Whole _Words
ja: 単語全体で一致(_W)

source: Use Regular _Expressions
ja: 正規表現を使用(_E)

source: Close the panel (Escape key)
ja: パネルを閉じる (Esc キー)
ru: Закрыть панель (Клавиша Escape)

source: _Find in Project
ja: プロジェクト内を検索(_F)
ru: _Найти в проекте

source: _Replace in Project
ja: プロジェクト内を置換(_R)
ru: _Заменить в проекте

source: Search for…
ja: 検索…
ru: Найти…

source: _Find
ja: 検索(_F)
ru: _Искать

source: Search _recursively through folders
ja: フォルダーを再帰的に検索(_R)
ru: Поиск по папкам рекурсивно

source: Match _case when searching
ja: 検索時に大文字と小文字を区別(_C)
ru: Учитывать регистр

source: Match _whole words
ja: 単語全体で一致(_W)
ru: Только полные слова

source: Allow regular _expressions
ja: 正規表現を許可(_E)
ru: Регулярные _выражения

source: _Find in Files
ja: ファイル内を検索(_F)
ru: _Найти в файлах

source: Host Operating System
ja: ホスト OS
ru: Операционная система хоста

source: Bundled with Builder
ja: ビルダーに同梱

source: Open Preview…
ja: プレビューを開く…

source: Failed to load directory: %s
ja: ディレクトリの読み込みに失敗しました: %s
ru: Не удалось открыть каталог: %s

source: Modified
ja: 変更済み
ru: Модифицирован

source: With _Folder Listing
ja: フォルダーリスト(_F)

source: Open Containing Folder
ja: 親フォルダー開く

source: With File _Browser…
ja: ファイルブラウザ(_B)…

source: Empty Makefile Project
ja: 空の Makefile プロジェクト
ru: Пустой проект с использованием Makefile

source: Create a new empty project using a simple Makefile
ja: シンプルな Makefile を用いて、新しい空のプロジェクトを作成する
ru: Создать новый пустой проект, используя обычный Makefile

source: Default Make Target
ja: 既定の Make ターゲット

source: Make Run
ja: Make 実行

source: Manuals
ja: マニュアル

source: Filter…
ja: フィルター…

source: Open Documentation
ja: ドキュメントを開く

source: Search Manuals…
ja: マニュアルを検索…

source: Search documentation for installed SDKs
ja: インストール済みの SDK のドキュメントを検索する

source: View in %s
ja: %s 内を表示

source: Importing %s…
ja: %s をインポート中…

source: Importing JHBuild Documentation
ja: JHBuild ドキュメントをインポート中

source: Scanning jhbuild for new documentation
ja: 新しいドキュメントのために jhbuild をスキャン中

source: Importing System Documentation
ja: システムドキュメントをインポート中

source: Scanning system for new documentation
ja: システムから新しいドキュメントをスキャン中

source: Maven Run
ja: Maven 実行

source: Global Search
ja: グローバル検索

source: Display the global search
ja: グローバル検索を表示

source: Panels
ja: パネル
ru: Панели

source: Toggle Left Panel
ja: 左パネルの切り替え

source: Toggle the left panel in or out of view
ja: 左パネルの表示/非表示を切り替える

source: Toggle the right panel in or out of view
ja: 右パネルの表示/非表示を切り替え

source: Toggle Bottom Panel
ja: 下パネルの切り替え

source: Toggle the bottom panel in or out of view
ja: 下パネルの表示/非表示を切り替える

source: Switch to Dark Mode
ja: ダークモードに切り替え

source: Change style-scheme to dark variant
ja: スタイルスキームをダークバリアントに切り替える

source: Switch to Light Mode
ja: ライトモードに切り替え

source: Change style-scheme to light variant
ja: スタイルスキームをライトバリアントに切り替える

source: Display Build Diagnostics
ja: ビルド診断を表示

source: Display errors and warnings found during build
ja: ビルド中に検出されたエラーと警告を表示する

source: Jump to a specific line or column
ja: 特定の行または列に移動する

source: Close Page
ja: ページを閉じる

source: Close the current page
ja: 現在のページを閉じる

source: Reveal in Project Tree
ja: プロジェクトツリーで表示
ru: Показать в дереве проекта

source: Reveal the current page in the project tree
ja: プロジェクトツリーで現在のページを表示する

source: Save the current page
ja: 現在のページを保存する
ru: Сохранить текущую страницу

source: Move Page Down
ja: ページを下に移動

source: Move the current page down
ja: 現在のページを下に移動する

source: Move Page Left
ja: ページを左に移動
ru: Переместить страницу влево

source: Move the current page left
ja: 現在のページを左に移動する

source: Move Page Right
ja: ページを右に移動
ru: Переместить страницу вправо

source: Move the current page right
ja: 現在のページを右に移動する

source: Move Page Up
ja: ページを上に移動

source: Move the current page up
ja: 現在のページを上に移動する

source: Reload Files
ja: ファイルを再読み込み

source: Reload the contents of open files
ja: 開いているファイルの内容を再読み込み

source: Print the current page
ja: 現在のページを印刷

source: Find a string in the current page
ja: 現在のページ内で文字列を検索

source: Find and replace a string in the current page
ja: 現在のページ内で文字列を検索して置換する

source: Move to next search result
ja: 次の検索結果に移動

source: Move to and select the next available search result
ja: 次の利用可能な検索結果に移動して選択する

source: Move to previous search result
ja: 前の検索結果に移動

source: Move to and select the previous search result
ja: 前の利用可能な検索結果に移動して選択する

source: GNOME Application
ja: GNOME アプリケーション
ru: Приложение GNOME

source: A Meson-based project for GNOME using GTK 4 and libadwaita
ja: GTK 4 と libadwaita を使用した GNOME 向けの Meson ベースプロジェクト

source: GTK 4 Application
ja: GTK 4 アプリケーション

source: A Meson-based project using GTK 4
ja: GTK 4 を使用する Meson ベースのプロジェクト

source: Shared Library
ja: 共有ライブラリ
ru: Разделяемая библиотека

source: A Meson-based project for a shared library
ja: 共有ライブラリ向けの Meson ベースプロジェクト

source: Command Line Tool
ja: コマンドラインツール
ru: Инструмент командной строки

source: An Meson-based project for a command-line program
ja: コマンドラインプログラム向けの Meson ベースプロジェクト

source: Empty Meson Project
ja: 空の Meson プロジェクト

source: An empty Meson project skeleton
ja: 空の Meson プロジェクトスケルトン

source: Load Meson Introspection
ja: Meson Introspection を読み込む

source: Install project
ja: プロジェクトをインストール
ru: Установить проект

source: Cache development environment
ja: 開発環境をキャッシュ

source: Delete Tool
ja: ツールを削除
ru: Удалить инструмент

source: Compiler
ja: コンパイラー
ru: Компилятор

source: Preprocessor
ja: プリプロセッサー
ru: Препроцессор

source: Archiver
ja: アーカイバー
ru: Архиватор

source: Linker
ja: リンカー
ru: Компоновщик

source: Strip
ja: ストリップ
ru: Инструмент удаления отладочных символов

source: Executable wrapper
ja: 実行可能ラッパー
ru: Обёртка исполняемых файлов

source: Package Config
ja: パッケージの構成
ru: Конфигуратор пакетов (pkg-config)

source: Debug
ja: デバッグ

source: Info
ja: 情報

source: Message
ja: メッセージ

source: Warning
ja: 警告

source: Critical
ja: クリティカル

source: Messages
ja: メッセージ
ru: Сообщения

source: Time
ja: 時間

source: Severity
ja: 重大度

source: Section
ja: セクション

source: Suggested GNOME Projects
ja: 提案された GNOME プロジェクト
ru: Попробуйте один из проектов GNOME

source: A GNOME application to access remote or virtual systems
ja: リモートまたは仮想システムにアクセスする GNOME アプリケーション

source: An IDE for writing GNOME-based software
ja: GNOME ベースのソフトウェアを開発するための IDE
ru: IDE для разработки приложений для GNOME

source: Calendar
ja: カレンダー
ru: Календарь

source: A calendar application for GNOME
ja: GNOME 向けのカレンダーアプリケーション

source: Clocks
ja: 時計
ru: Часы

source: A clock application for GNOME
ja: GNOME 向けの時計アプリケーション

source: Gitg is a graphical Git client
ja: Gitg はグラフィカルな Git クライアント
ru: Графический Git-клиент

source: Maps
ja: 地図
ru: Карты

source: A GNOME maps application
ja: GNOME 向けのマップアプリケーション

source: Music
ja: ミュージック
ru: Музыка

source: Music player and management application
ja: 音楽プレーヤーおよび管理アプリケーション
ru: Воспроизведение и управление музыкальной коллекцией

source: Default file manager for GNOME
ja: GNOME 向けの標準ファイルマネージャー
ru: Менеджер файлов по умолчанию для GNOME

source: An IRC Client for GNOME
ja: GNOME 向けの IRC クライアント
ru: IRC-клиент для GNOME

source: A modern sound recorder for GNOME
ja: GNOME 向けのモダンなサウンドレコーダー

source: Build successful
ja: ビルド成功
ru: Сборка прошла успешно

source: Project “%s” has completed building
ja: プロジェクト “%s” のビルドが完了しました
ru: Сборка проекта «%s» завершена

source: Build failed
ja: ビルド失敗
ru: Сборка завершилась с ошибкой

source: Project “%s” failed to build
ja: プロジェクト “%s” のビルドに失敗しました
ru: Ошибка при сборке проекта «%s»

source: Build succeeded
ja: ビルドに成功しました
ru: Сборка прошла успешно

source: Build configured
ja: ビルドの構成が完了しました
ru: Настройка сборки завершена

source: Build bootstrapped
ja: ビルドのブートストラップが完了しました
ru: Сборка инициализирована

source: Downloading npm dependencies
ja: npm の依存関係をダウンロード中
ru: Загрузка зависимостей npm

source: _External Program…
ja: 外部プログラム(_E)…
ru: _Внешняя программа…

source: Follow System
ja: システムに従う

source: Light
ja: ライト
ru: Светлый

source: Dark
ja: ダーク
ru: Тёмный

source: Document Navigation
ja: ドキュメントナビゲーション

source: Tab Bar
ja: タブバー

source: Drop Down
ja: ドロップダウン

source: Containers/Toolbox
ja: コンテナ/Toolbox
ru: Контейнеры/Toolbox

source: Containers/Podman
ja: コンテナ/Podman
ru: Контейнеры/Podman

source: A folder with that name already exists.
ja: その名前のフォルダーは既に存在します。
ru: Папка с таким именем уже существует.

source: A file with that name already exists.
ja: その名前のファイルは既に存在します。
ru: Файл с таким именем уже существует.

source: File Name
ja: ファイル名
ru: Имя файла

source: Folder Name
ja: フォルダー名
ru: Имя папки

source: New File Name
ja: 新しいファイル名

source: _Create
ja: 作成(_C)
ru: _Создать

source: Copying 1 file
ja: 1 ファイルをコピーしています
ru: Копирование 1 файла

source: Copying %s of %s files
ja: %2$s ファイル中 %1$s ファイルをコピーしています
ru: Копирование %s из %s файлов

source: Failed to copy files
ja: ファイルのコピーに失敗しました
ru: Не удалось скопировать файлы

source: Files copied
ja: ファイルをコピーしました
ru: Файлы скопированы

source: Copied %s file
ja: %s 個のファイルをコピーしました
ru: Скопирован %s файл

source: Copying files…
ja: ファイルのコピー…
ru: Копирование файлов…

source: Files will be copied in a moment
ja: ファイルはまもなくコピーされます
ru: Файлы будут скопированы через мгновение

source: Project Tree
ja: プロジェクトツリー
ru: Дерево проекта

source: Rename %s
ja: “%s” の名前を変更
ru: Переименовать %s

source: New Fil_e…
ja: 新しいファイル(_E)…
ru: Создать _файл…

source: New F_older…
ja: 新しいフォルダー(_O)…
ru: Создать _папку…

source: O_pen
ja: 開く(_P)
ru: _Открыть

source: Open _With…
ja: 他のアプリケーションで開く(_W)…
ru: Открыть _с помощью…

source: _Source Code Editor
ja: ソースコードエディター(_S)
ru: Редактор _исходного кода

source: Open _Containing Folder
ja: ファイルのあるフォルダーを開く(_C)
ru: Открыть папку с_одержащую объект

source: With _Terminal…
ja: 端末(_T)

source: _Move to Trash
ja: ゴミ箱へ移動(_M)
ru: О_тправить в корзину

source: _Display Options
ja: 表示オプション(_D)
ru: Параметры ото_бражения

source: S_how Ignored Files
ja: 無視したファイルを表示(_H)
ru: Показывать про_игнорированные файлы

source: S_ort Directories First
ja: ディレクトリを先頭に表示(_O)
ru: Сначала _директории

source: Reveal in Project _Tree
ja: プロジェクトツリーで表示(_T)

source: Display icons next to files within the project tree
ja: プロジェクトツリー内のファイルの横にアイコンを表示

source: Show files which are typically ignored
ja: 通常は無視されるファイルを表示する

source: Sort directories before files in the same directory
ja: 同じディレクトリ内では、ディレクトリをファイルよりも先に並べる

source: No version control
ja: バージョン管理無し

source: Restore Previous Session
ja: 以前のセッションを復元

source: Open previously opened files when loading a project
ja: プロジェクト読み込み時に、以前開いていたファイルを開く
ru: Открывать ранее открытые файлы при загрузке проекта

source: Project Creation
ja: プロジェクトの作成

source: Projects created with Builder will be placed within this directory
ja: ビルダーで作成されたプロジェクトは、このディレクトリ内に配置されます

source: The default license when creating new projects
ja: 新規プロジェクト作成時のデフォルトライセンス

source: No License
ja: ライセンスなし

source: Overview
ja: 概要
ru: Обзор

source: Project Identifier
ja: プロジェクト識別子

source: This identifier is used when referencing your project's settings, build directories, and cached information.
ja: この識別子はプロジェクトの設定、ビルドディレクトリ、およびキャッシュされた情報を参照する際に使用されます。

source: Build System
ja: ビルドシステム
ru: Система сборки

source: Source Directory
ja: ソースディレクトリ
ru: Директория с исходным кодом

source: Current Configuration
ja: 現在の構成

source: The configuration is used to setup build pipelines, configure your build system, and run your project.
ja: この構成は、ビルドパイプラインのセットアップ、ビルドシステムの構成、そしてプロジェクトの実行に使用されます。

source: Provided By
ja: 提供者

source: Aarch64 Emulation
ja: Aarch64 エミュレーション
ru: Эмуляция Aarch64

source: Arm Emulation
ja: Arm エミュレーション
ru: Эмуляция Arm

source: My Computer (%s) %s
ja: コンピューター (%s) %s
ru: Мой компьютер (%s) %s

source: Removed Files
ja: 削除されたファイル

source: Removing %s
ja: %s を削除中
ru: Удаление %s

source: Removing Files…
ja: ファイルを削除中…
ru: Удаление файлов…

source: Show More
ja: さらに表示

source: Recent Projects
ja: 最近のプロジェクト
ru: Недавние проекты

source: _Reformat Tabs
ja: タブを再フォーマット(_R)

source: Update
ja: 更新

source: Manage SDKs…
ja: SDK を管理…

source: Downloads
ja: ダウンロード

source: Download on Metered Connections
ja: 従量課金制接続時にダウンロード

source: Allow the download of SDKs and dependencies when on metered internet connections
ja: 従量課金制接続時に SDK および依存関係のダウンロードを許可する

source: Sources
ja: ソース

source: Available SDKs
ja: 利用可能な SDK

source: Untitled Command
ja: 無題のコマンド

source: Set Shortcut
ja: ショートカットを設定

source: Select Working Directory
ja: 作業ディレクトリを選択

source: Create Command
ja: コマンドを作成

source: Cre_ate
ja: 作成(_A)

source: Edit Command
ja: コマンドを編集

source: S_ave
ja: 保存(_A)

source: Keyboard Shortcut
ja: キーボードショートカット
ru: Комбинация клавиш

source: An optional shortcut to run the command
ja: コマンドを実行するための任意のショートカット

source: Shell Command
ja: シェルコマンド
ru: Команда оболочки

source: You may use single or double quotes for parameters.
ja: パラメータには、シングルクオートまたはダブルクオートを使用できます。

source: Environment
ja: 環境
ru: Окружение

source: Working Directory
ja: 作業ディレクトリ

source: The command will be run from this location. Use <tt>$BUILDDIR</tt>, <tt>$SRCDIR</tt>, or <tt>$HOME</tt> to define a relative path.
ja: コマンドはこの場所から実行されます。相対パスを定義するには、<tt>$BUILDDIR</tt>、<tt>$SRCDIR</tt>、または <tt>$HOME</tt> を使用してください。

source: Use Subshell
ja: サブシェルを使用

source: Run the program from a subshell such as <tt>sh -c ''</tt>
ja: プログラムは <tt>sh -c ''</tt> などのサブシェルから実行されます

source: Builder can run your command from a number of localities including the host system or build containers.
ja: ビルダーは、ホストシステムやビルドコンテナなど、複数の場所からコマンドを実行できます。

source: _Delete Command
ja: コマンドを削除(_D)

source: Subprocess
ja: サブプロセス

source: Runs the command as a subprocess of Builder.
ja: ビルダーのサブプロセスとしてコマンドを実行します。

source: Runs the command on the host system.
ja: ホストシステムでコマンドを実行します。

source: Runs the command within the build pipeline.
ja: ビルドパイプライン内でコマンドを実行します。

source: As Target Application
ja: ターゲットアプリケーションとして

source: Runs the command as if it were the target application.
ja: ターゲットアプリケーションであるかのように、コマンドを実行する。

source: Commands can be used to build, run, or modify your projects
ja: コマンドはプロジェクトのビルド、実行、または変更に使用できます

source: These commands are specific to this project.
ja: これらのコマンドは、このプロジェクト専用です。

source: These commands are shared across all projects.
ja: これらのコマンドは、すべてのプロジェクトで共有されます。

source: Display Name
ja: ディスプレイ名

source: Keyboard Accelerator
ja: キーボードアクセラレーター

source: Current Working Directory
ja: 現在の作業ディレクトリ

source: Command Arguments
ja: コマンドの引数

source: Command Environment
ja: コマンド環境

source: Command Locality
ja: コマンド実行場所
ru: Среда выполнения команды

source: Use Shell
ja: シェルを使用

source: Run Commands
ja: コマンドを実行

source: A list of run-command ids to load for the application or project.
ja: アプリケーションまたはプロジェクト用に読み込む実行コマンドIDのリスト。

source: Use commands to run build tooling, applications, or shell scripts and map them to a keyboard shortcut. They can run from various environments such as the build pipeline, runtime environment, or host operating system.
ja: コマンドを使用して、ビルドツール、アプリケーション、またはシェルスクリプトを実行し、キーボードショートカットに割り当てます。これらのコマンドは、ビルドパイプライン、実行環境、またはホストオペレーティングシステムなど、さまざまな環境で実行できます。

source: No keyboard shortcut found
ja: キーボードショートカットが見つかりません

source: Try a different search
ja: 別の検索を試してください

source: _Reset All
ja: すべてリセット(_R)

source: Reset all actions to original keyboard shortcut
ja: すべてのアクションのキーボードショートカットを元の状態にリセットします

source: _Edit File
ja: ファイルを編集(_E)

source: Open keybindings.json in editor
ja: エディターで keybindings.json を開く

source: Reset shortcut
ja: キーボードショートカットをリセット

source: View and Customize Shortcuts…
ja: キーボードショートカットを表示およびカスタマイズ…

source: Keyboard Theme
ja: キーボードテーマ

source: Shortcut themes provide a keyboard experience similar to other IDEs and editors
ja: ショートカットテーマは、他のIDEやエディターと同様のキーボード操作体験を提供します

source: Symbols in File
ja: ファイル内シンボル

source: In Page
ja: ページ内

source: Select Symbol…
ja: シンボルを選択…

source: Select Symbol (Ctrl+Shift+K)
ja: シンボルを選択 (Ctrl+Shift+K)

source: Navigate to a symbol within the current page
ja: 現在のページ内のシンボルへ移動

source: System Capture from %s.syscap
ja: %s.syscap からのシステムキャプチャ

source: Profiling Application…
ja: アプリケーションをプロファイリング中…

source: Symbol decoding will begin after application exits
ja: アプリケーション終了後に、シンボルのデコードが開始されます

source: Run with Profiler
ja: プロファイラで実行
ru: Запустить с помощью профайлера

source: Run the project with profiler
ja: プロジェクトをプロファイラで実行する

source: Profiler
ja: プロファイラ
ru: Профайлер

source: Thread Sampling
ja: スレッドサンプリング

source: CPU Performance
ja: CPUパフォーマンス

source: Process Scheduling
ja: プロセススケジューリング

source: Memory Allocations
ja: メモリ割り当て

source: Sample JavaScript Stacks
ja: JavaScript スタックのサンプル

source: Session Bus
ja: セッションバス

source: System Bus
ja: システムバス

source: Graphics
ja: グラフィックス

source: Display Timings
ja: ディスプレイタイミング

source: Counters
ja: カウンター

source: CPU Usage
ja: CPU 使用率

source: Memory Usage
ja: メモリ使用率

source: Storage I/O
ja: ストレージ I/O

source: Network I/O
ja: ネットワーク I/O

source: Energy
ja: エネルギー

source: Consumption
ja: 消費

source: Battery Charge
ja: バッテリー残量

source: Allow Application Integration
ja: アプリケーション統合を許可

source: Allow CPU Throttling
ja: CPU スロットリングを許可

source: Run with _Profiler
ja: プロファイラで実行(_P)
ru: Запустить с помощью _профайлера

source: Record Again…
ja: もう一度記録…

source: Instruments
ja: インストゥルメント

source: Records CPU usage and CPU frequency statistics
ja: CPU 使用率および CPU 周波数の統計情報を記録します

source: Sample Callstacks
ja: コールスタックのサンプル

source: Record stacktraces on a regular interval and build a callgraph
ja: 定期的にスタックトレースを記録し、コールグラフを構築する

source: Scheduler Details
ja: スケジューラーの詳細

source: Track when processes are scheduled per CPU
ja: CPU ごとにプロセスがスケジュールされるタイミングを追跡する

source: CPU Governor
ja: CPU ガバナー

source: Force performance mode while profiling
ja: プロファイリング中にパフォーマンスモードを強制する

source: Don't Change Governor
ja: ガバナーを変更しない

source: Force Performance Mode
ja: パフォーマンスモードを強制する

source: Simple memory statistics about the process such as total memory used
ja: プロセスに関するシンプルなメモリ統計情報（例：使用メモリの合計）

source: Memory Profiling
ja: メモリプロファイリング

source: Record stacktraces of memory allocations and releases
ja: メモリ割り当ておよび解放のスタックトレースを記録する

source: Record D-Bus messages on the session bus
ja: セッションバス上の D-Bus メッセージを記録する

source: Record D-Bus messages on the system bus
ja: システムバス上の D-Bus メッセージを記録する

source: Energy Usage
ja: エネルギー使用状況

source: Record statistics about energy usage using RAPL
ja: RAPL を使用してエネルギー使用統計を記録する

source: Battery Usage
ja: バッテリー使用状況

source: Record statistics about battery charge and discharge rates
ja: バッテリーの充電および放電レートに関する統計を記録する

source: Network Usage
ja: ネットワーク使用状況

source: Record statistics about network usage
ja: ネットワークの使用状況に関する統計情報を記録する

source: GNOME Shell Performance
ja: GNOME Shell のパフォーマンス

source: Collect performance and timing information from GNOME Shell
ja: GNOME Shell からパフォーマンスおよびタイミング情報を収集する

source: Integration
ja: 統合

source: Collect information from GJS-based applications
ja: GJS ベースのアプリケーションから情報を収集する

source: Application Tracing
ja: アプリケーショントレース

source: Provide TRACE_FD environment variable for applications to deliver custom events
ja: アプリケーションがカスタムイベントを送信できるように TRACE_FD 環境変数を提供する

source: Application started at %s
ja: アプリケーションは %s に起動しました

source: Application Output
ja: アプリケーション出力
ru: Вывод приложения

source: Process completed
ja: プロセス完了

source: New _Terminal
ja: 新しい端末(_T)
ru: Новый _терминал

source: Open a new terminal on the host operating system
ja: ホスト OS 上で新しい端末を開く

source: New _Build Terminal
ja: 新しいビルド端末(_B)
ru: Новый терминал среды _сборки

source: Open a new terminal in project's build pipeline
ja: プロジェクトのビルドパイプライン上で新しい端末を開く

source: New _Runtime Terminal
ja: 新しいランタイム端末(_R)
ru: Новый терминал среды _выполнения

source: Open a new terminal in project's runtime environment
ja: プロジェクトのランタイム環境上で新しい端末を開く

source: Split
ja: 分割
ru: Разделить

source: Allow Bold
ja: 太字を許可

source: Allows the use of bold escape sequences
ja: 太字のエスケープシーケンスの使用を許可する

source: Allow Hyperlinks
ja: ハイパーリンクを許可

source: Allows the use of hyperlink escape sequences
ja: ハイパーリンクのエスケープシーケンスの使用を許可する

source: Scrolling
ja: スクロール

source: Scroll On Output
ja: 出力時にスクロール

source: Automatically scroll when applications within the terminal output text
ja: ターミナル内のアプリケーションがテキストを出力した際に、自動的にスクロールする

source: Scroll On Keyboard Input
ja: キーボード入力時にスクロール

source: Automatically scroll when typing to insert text
ja: テキスト挿入時のキーボード入力に伴い、自動的にスクロールする

source: Limit Scrollback
ja: スクロールバックを制限する
ru: Лимит обратной прокрутки

source: Limit the number of lines that are stored in memory for terminal scrollback
ja: ターミナルのスクロールバックに保持される行数を制限する

source: Maximum Lines in Scrollback
ja: スクロールバックの最大行数

source: The maximum number of lines stored in history when limiting scrollback
ja: スクロールバック制限時に保持される履歴の最大行数
