Repository: GNOME/gnome-builder
Catalog: po/*.po
Languages: ja, ru

source: Styling, alignment, and other common properties
ru: Стили, выравнивание и другие общие свойства

source: Accessibility properties
ru: Свойства доступности

source: Open _Preview
ru: Открыть _предпросмотр

source: Cut
ru: Вырезать

source: Paste
ru: Вставить

source: Redo
ru: Вернуть

source: UI Designer
ru: Дизайнер пользовательских интерфейсов

source: _UI Designer
ru: Дизайнер _пользовательских интерфейсов

source: Code assistance requires a local file.
ru: Для помощи при написании кода требуется локальный файл.

source: Enable the use of pylint, which may execute code in your project
ru: Включить использование pylint, для возможности выполнения кода в вашем проекте

source: pylint python lint code execute execution
ru: pylint python lint код выполнить выполнение

source: No language specified
ru: Язык не указан

source: Enable Pylint
ru: Включить Pylint

source: Enable the use of pylint to find additional diagnostics in Python programs. This may result in the execution of code in your project.
ru: Включить использование pylint, чтобы найти дополнительную диагностическую информацию в программах на Python. Это может привести к выполнению кода в вашем проекте.

source: Gradle Wrapper
ru: Обёртка Gradle

source: Quit
ru: Завершить

source: Show Find in Project panel
ru: Показать панель поиска в проекте

source: Find and Replace
ru: Найти и заменить

source: R_ecursive
ru: Р_екурсивно

source: Match _Case
ru: Учитывать _регистр

source: Match _Words
ru: Только целые _слова

source: Regular E_xpressions
ru: Регулярные _выражение

source: Open Preview
ru: Открыть предпросмотр

source: Your computer is missing python3-docutils
ru: На компьютере отсутствует python3-docutils

source: This package is necessary to provide previews of markup-based documents.
ru: Этот пакет необходим для предоставления предпросмотра документов, написанных на языках разметки.

source: Install Package
ru: Установить пакет

source: Your computer is missing python3-sphinx
ru: На компьютере отсутствует python3-sphinx

source: (Preview)
ru: (Предпросмотр)

source: Indexing php code…
ru: Индексирование php кода…

source: %s — Directory
ru: %s — Каталог

source: _Browse Folder
ru: _Обзор папки

source: S_witch to Folder
ru: _Переключиться к папке

source: _Open Containing Folder
ru: _Открыть папку, содержащую объект

source: GTK Application (Legacy)
ru: Приложение GTK (Legacy)

source: Create a GTK application with GTK 3
ru: Создать приложение с GTK 3

source: GTK Application
ru: Приложение GTK

source: Create a GTK application
ru: Создать приложение GTK

source: Create a GNOME application
ru: Создать приложение GTK

source: Create a new project with a shared library
ru: Создать новый проект с библиотекой

source: Empty Project
ru: Пустой проект

source: Create a new empty project
ru: Создать новый пустой проект

source: Create a new command line project
ru: Создать пустой проект для командной строки

source: Meson Options
ru: Параметры Meson

source: A Meson-based project is loaded but meson could not be found.
ru: Загружен проект Meson, но утилита meson не найдена.

source: A Meson-based project is loaded but Ninja could not be found.
ru: Загружен проект Meson, но утилита Ninja не найдена.

source: Add toolchain
ru: Добавить набор инструментов

source: Define a new custom toolchain targeting a specific platform
ru: Определить набор инструментов для сборки под конкретную платформу

source: Toolchain
ru: Наборы инструментов

source: No Provided Tool
ru: Нет инструментов

source: A name to identify the sysroot.
ru: Имя для идентификации корневого каталога.

source: The system architecture of the sysroot.
ru: Системная архитектура корневого каталога.

source: Add Tool:
ru: Добавить инструмент:

source: Any language
ru: Любой язык

source: Add Tool
ru: Добавить инструмент

source: Delete Toolchain
ru: Удалить набор инструментов

source: Boxes
ru: Боксы

source: A simple GNOME 3 application to access remote or virtual systems
ru: Простое GNOME3 приложение для удаленного доступа или виртуальных систем

source: Calendar application for GNOME
ru: Календарь для GNOME

source: A simple clock application for GNOME
ru: Простое приложение-часы для GNOME

source: A simple GNOME 3 maps application
ru: Простое картографическое приложение GNOME 3

source: Nautilus
ru: Файлы

source: Photos
ru: Фото

source: Access, organize and share your photos on GNOME
ru: Доступ, управление и обмен фотографиями

source: Sound Recorder
ru: Диктофон

source: A simple and modern sound recorder
ru: Простое, современное приложение для записи звука в GNOME

source: Open in _Terminal
ru: Открыть в _терминале

source: Reveal File in Project _Tree
ru: Показать в де_реве проекта

source: Words matching selection
ru: Слова, соответствующие выбору

source: Highlight all occurrences of words matching the current selection
ru: Выделить все вхождения слов, соответствующие текущему выбору

source: quick highlight words matching current selection
ru: быстрая подсветка слов соответствующих текущему выбору

source: Minimum length for highlight
ru: Минимальная длина подсветки

source: Highlight words matching at least this number of characters
ru: Подсвечивать слова, соответствующие как минимум этому количеству символов

source: quick highlight words matching current selection minimum length
ru: быстрая подсветка слов соответствующих выбранной минимальной длине

source: _Reformat tabs
ru: _Переформатировать табуляции

source: Rust Analyzer: Cargo command for diagnostics
ru: Rust Analyzer: команда Cargo для диагностики

source: the default cargo command
ru: команда cargo по умолчанию

source: clippy adds additional lints to catch common mistakes but is in general slower
ru: clippy добавляет дополнительные линты для поиска распространенных ошибок, но, как правило, он медленный

source: Shell command
ru: Команда оболочки

source: Cannot spawn terminal in runtime environment because build pipeline is not initialized
ru: Нельзя запустить терминал в среде выполнения, потому что конвейер сборки ещё не инициализирован

source: Cannot spawn process because build pipeline is not yet available
ru: Нельзя запустить процесс, потому что конвейер сборки ещё не доступен

source: Change Shortcut
ru: Изменить комбинацию клавиш

source: Title
ru: Название

source: The command will be executed using a shell like “/bin/sh -c". You may use variable expansion like “$SHELL”. Both “$SRCDIR” and “$BUILDDIR” are automatically set for the command.
ru: Команда будет выполнена с использованием оболочки, такой как «/bin/sh -c». Вы можете использовать переменные, например, «$SHELL». Переменные «$SRCDIR» и «$BUILDDIR» определяются для команды автоматически.

source: On Host
ru: На основной системе

source: In Build Environment
ru: Окружение сборки

source: In Runtime Environment
ru: Окружение выполнения

source: If the directory is not an absolute-path, it will be relative to the source or build directory depending on the command locality.
ru: Если путь к директории не абсолютный, то он рассматривается относительно директории с исходными файлами или директории сборки в зависимости от среды выполнения команды.

source: Close on Exit
ru: Закрыть при завершении

source: If enabled, the terminal page will close after the command executes.
ru: Закрыть окно терминала при завершении выполнения команды.

source: Change
ru: Изменить

source: Delete Command
ru: Удалить команду

source: Run in host environment
ru: Запустить на хосте

source: Run in build environment
ru: Запустить в среде сборки

source: Run in runtime environment
ru: Запустить в среде выполнения

source: New command
ru: Новая команда

source: Click + to add an external command
ru: Нажмите +, чтобы добавить команду

source: External Commands
ru: Команды

source: Command
ru: Команда

source: Failed to parse snippet “%s”
ru: Не удалось разобрать фрагмент «%s»

source: Suggest Completions from Snippets
ru: Предлагать автодополнения из фрагментов текста

source: Use registered snippets to suggest completion proposals
ru: Использовать зарегистрированные фрагменты текста для предложения автодополнений

source: Show the spellchecker panel
ru: Показывать панель проверки правописания

source: Failed to initialize spellchecking, disabling
ru: Не удалось инициализировать проверку правописания, отключение

source: No language selected
ru: Язык не выбран

source: No language set. Check your dictionary installation.
ru: Язык не выбран. Проверьте вашу установку словарей.

source: No suggestions
ru: Нет предложений

source: Completed spell checking
ru: Проверка орфографии завершена

source: The word is not in the dictionary
ru: Слово отсутствует в словаре

source: This word is already in the personal dictionary
ru: Это слово уже находится в персональном словаре

source: This word is already in the %s dictionary
ru: Это слово уже находиться в словаре %s

source: Misspelled
ru: Ошибка в написании

source: _Ignore
ru: И_гнорировать

source: Ignore _All
ru: _Игнорировать все

source: Change _to
ru: За_менить на

source: Cha_nge
ru: З_аменить

source: Change A_ll
ru: _Заменить все

source: _Suggestions
ru: _Предложения

source: Add Word
ru: Добавить слово

source: A_dd
ru: _Добавить

source: Dictionary
ru: Словарь

source: _Language
ru: _Язык

source: Check _Spelling
ru: Проверить _правописание

source: _Underline misspelled words
ru: _Подчёркивать слова с ошибками

source: Enable Stylelint
ru: Включить Stylelint

source: Enable the use of stylelint to find additional diagnostics in stylesheet files. This may result in the execution of code in your project.
ru: Включить использование stylelint, чтобы найти дополнительную диагностическую информацию в файлах таблиц стилей. Это может привести к выполнению кода в вашем проекте.

source: Enable the use of Stylelint, which may execute code in your project
ru: Включить использование Stylelint, что может привести к выполнению кода в вашем проекте

source: stylelint stylesheet lint code execute execution
ru: stylelint stylesheet lint код выполнить выполнение

source: Emulates the Sublime Text editor
ru: Эмулирует текстовый редактор Sublime Text

source: Generate Support Log
ru: Создать журнал поддержки

source: The support log file has been written to “%s”. Please provide this file as an attachment on your bug report or support request.
ru: Файл журнала поддержки был записан в «%s». Предоставьте этот файл как вложение к сообщению об ошибке или запросу поддержки.

source: Search symbols within document
ru: Поиск символов в документе

source: Unnamed Symbol
ru: Безымянный символ

source: Symbol
ru: Символ

source: _Select Symbol…
ru: _Выбрать символ…

source: Document Outline
ru: Обзор документа

source: _Document Outline
ru: _Обзор документа

source: Open Sysprof Capture…
ru: Открыть захват профайлера…

source: Sysprof Capture (*.syscap)
ru: Захват Sysprof (*.syscap)

source: All Files
ru: Все файлы

# menu label
source: Open _Sysprof Capture…
ru: Открыть Захват _Sysprof…

source: Add sysroot
ru: Добавить корневой каталог

source: Define a new sysroot target to build against a different target
ru: Определить новый корневой каталог для сборки для другой целевой системы

source: Sysroots
ru: Корневые каталоги

source: An absolute file-system path to the sysroot.
ru: Абсолютный путь к корневому каталогу.

source: Package Config Path
ru: Путь к файлам конфигурации пакетов

source: An optional comma-separated path to specify PKG_CONFIG_PATH.
ru: Необязательный список путей, разделённых запятыми, который будет записан в PKG_CONFIG_PATH.

source: %s (Sysroot SDK)
ru: %s (SDK из корневого каталога)

source: Use terminal interface
ru: Использовать терминальный интерфейс

source: Scrollback
ru: Прокрутка назад

# Keywords
source: terminal font monospace
ru: моноширинный шрифт терминала

source: Bold text in terminals
ru: Жирный текст в терминалах

source: If terminals are allowed to display bold text
ru: Разрешить терминалам отображать жирный текст

# Keywords
source: terminal allow bold
ru: терминал разрешить жирный

source: Show hyperlinks
ru: Показывать гиперссылки

source: When enabled hyperlinks (OSC 8 escape sequences) are recognized and displayed
ru: Если включено, программа будет распознавать и показывать гиперссылки (управляющие последовательности OSC 8)

# Keywords
source: terminal show hyperlinks links urls
ru: терминал показывает гиперссылки url-адреса

source: Scroll on output
ru: Прокручивать при выводе

source: When enabled the terminal will scroll to the bottom when new output is displayed
ru: Когда включено, терминал будет прокручиваться вниз, во время появления нового вывода

# Keywords
source: scroll on output
ru: прокручивать при выводе

source: Scroll on keystroke
ru: Прокручивать по нажатию клавиши

source: When enabled the terminal will scroll to the bottom when typing
ru: Когда включено, терминал будет прокручиваться вниз при вводе

# Keywords
source: scroll on keystroke
ru: прокручивать по нажатию клавиши

source: When enabled terminal scrollback will be limited to the number of lines specified below
ru: При включении прокрутка терминала будет ограничена количеством строк, указанным ниже

# Keywords
source: scrollback limit
ru: лимит обратной прокрутки

source: Scrollback Lines
ru: Строки обратной прокрутки

source: The number of lines to keep available for scrolling
ru: Количество строк, доступных для прокрутки

# Keywords
source: scrollback lines
ru: строки обратной прокрутки

source: Application started at %s
ru: Приложение запущено в %s

source: Application exited
ru: Приложение завершилось

source: Terminal in Build Runtime
ru: Терминал в среде исполнения сборки

source: Terminal in Runtime
ru: Терминал в среде выполнения

source: Running test “%s”…
ru: Выполнение теста «%s»…

source: Please wait while we scan your project
ru: Пожалуйста подождите, пока производится сканирование вашего проекта

source: Run with Valgrind
ru: Запустить с помощью Valgrind

source: Tags
ru: Теги

source: Number required
ru: Необходимое количество

source: %s is invalid for %s
ru: %s недопустимо для %s

source: Cannot find language “%s”
ru: Не удалось найти язык «%s»

source: This command requires a GtkSourceView to be focused
ru: Эта команда требует активное окно GtkSourceView

source: This command requires a view to be focused
ru: Эта команда требует активный вид

source: Unknown option: %s
ru: Неизвестный параметр: %s

source: Cannot find colorscheme “%s”
ru: Не удалось найти цветовую схему «%s»

source: Failed to locate working directory
ru: Не удалось найти рабочую директорию

source: Invalid :syntax subcommand: %s
ru: Недопустимая синтаксическая субкоманда: %s

source: Invalid search and replace request
ru: Недопустимый запрос поиска и замены

source: Change the pages colorscheme
ru: Изменить цветовую схему страницы

source: Clear search highlighting
ru: Очистить подсветку поиска

source: Open a file by path
ru: Открыть файл по пути

source: Close the page
ru: Закрыть страницу

source: Set various buffer options
ru: Установить различные параметры буфера

source: Sort the selected lines
ru: Сортировать выделенные строки

source: Create a split page below the current page
ru: Создать разделённую страницу под текущей страницей

source: Toggle syntax highlighting
ru: Переключить подсветку синтаксиса

source: Save and close the current page
ru: Сохранить и закрыть текущую страницу

source: Not a command: %s
ru: Не является командой: %s

source: Emulates the Vim text editor
ru: Эмулирует текстовый редактор Vim

source: Building project…
ru: Проект собирается…

source: Installing project…
ru: Проект устанавливается…
