Repository: GNOME/gnome-builder
Catalog: po/*.po
Languages: ja, ru

source: Log to Console
ja: コンソールにログを出力

source: Redirect language server error logs to stderr
ja: 言語サーバーのエラーログを stderr にリダイレクトする

source: Workers
ja: ワーカー

source: Number of workers to use when performing builds
ja: ビルドを実行する時に使用するワーカーの数

source: 1 per CPU
ja: CPUごとに1つ

source: Tooling
ja: ツール

source: Installation Prefix
ja: インストールプレフィックス

source: The project will be installed to this directory during the installation phase of the build pipeline.
ja: ビルドパイプラインのインストールフェーズ中に、プロジェクトはこのディレクトリにインストールされる。

source: Configure Options
ja: オプション構成
ru: Параметры конфигурирования

source: These options are used by the build system to configure the project during the configure phase of the build pipeline
ja: これらのオプションは、ビルドパイプラインの構成フェーズ中に、ビルドシステムがプロジェクトを構成するために使用される

source: Build Environment
ja: ビルド環境
ru: Окружение сборки

source: Locality
ja: ローカリティ

source: Where your project builds
ja: プロジェクトがビルドされる場所

source: Inside Source Tree
ja: ソースツリー内

source: Outside Source Tree
ja: ソースツリー外

source: The SDK used to build your application is automatically determined from the runtime.
ja: アプリケーションのビルドに使用される SDK は、実行時環境から自動的に決定される。

source: Reformat Function Prototypes
ja: 関数プロトタイプを再フォーマット

source: Fetch dependencies
ja: 依存関係を取得

source: Build project
ja: プロジェクトをビルド
ru: Собрать проект

source: Cargo Run
ja: Cargo 実行

source: Failed to execute clang-format: %s
ja: clang-format の実行に失敗しました: %s

source: clang-format failed to format document: %s
ja: clang-format がドキュメントの整形に失敗しました: %s

source: Missing or corrupted data from clang-format
ja: clang-format からのデータが欠落しているか、破損しています

source: Invalid cursor position provided from clang-format
ja: clang-format から提供されたカーソル位置が無効です

source: Cannot locate .clang-format, please add one to your project. Using fallback GNU-style formatter.
ja: .clang-format が見つかりません。プロジェクトに .clang-format ファイルを追加してください。代わりに GNU スタイルのフォーマッターが使用されます。

source: Clang integration server has exited
ja: Clang統合サーバーが終了しました

source: Clang integration server has started as process %s
ja: Clang統合サーバーがプロセス %s として起動しました

source: anonymous
ja: 匿名
ru: анонимный

source: Complete parentheses
ja: 括弧を補完する
ru: Автодополнение круглых скобок

source: If parentheses should be included when completing.
ja: 補完時に括弧を含めるかどうか。
ru: Включать круглые скобки при автодополнении.

source: Complete parameters
ja: パラメーターを補完する
ru: Дополнять параметры

source: If parameters should be included when completing. Requires complete-parentheses.
ja: 補完時にパラメーターも含める場合は、complete-parentheses を有効にする必要があります。
ru: Включать параметры при автодополнении. Требует complete-parentheses.

source: Complete Parentheses
ja: 括弧を補完する

source: Include parentheses when completing clang proposals
ja: Clang 提案の補完時に括弧を含める

source: Complete Parameters
ja: パラメーターを補完する
ru: Автодополнение аргументов

source: Include parameters and type information when completing clang proposals
ja: Clang 提案の補完時にパラメーターおよび型情報を含める

source: Configure project
ja: プロジェクトを構成
ru: Конфигурация проекта

source: Installing project
ja: プロジェクトをインストール中
ru: Установка проекта

source: Create or update code-index for project file
ja: プロジェクトファイルのコードインデックスを作成または更新する
ru: Создать или обновить индекс кода для файла проекта

source: Failed to load flags for plan: %s
ja: プランのフラグの読み込みに失敗しました: %s
ru: Не удалось загрузить флаги для плана: %s

source: Failed to cull index plan: %s
ja: インデックスプランの間引きに失敗しました: %s
ru: Не удалось обрезать план индексирования: %s

source: Failed to populate index plan: %s
ja: インデックスプランの展開に失敗しました: %s
ru: Не удалось заполнить план индексирования: %s

source: Failed to load project: %s
ja: プロジェクトの読み込みに失敗しました: %s
ru: Не удалось загрузить проект: «%s»

source: Indexing Source Code
ja: ソースコードのインデックス作成中
ru: Индексирование исходного кода

source: Search, diagnostics, and autocompletion may be limited until complete.
ja: 検索、診断、および自動補完は、完了するまで制限される可能性があります。
ru: Поиск, диагностика и автодополнение могут быть ограничены до завершения.

source: Declaration
ja: 宣言
ru: Объявление

source: Project Symbols
ja: プロジェクトシンボル

source: Copy as Image
ja: 画像としてコピー

source: Copy selected text as an image
ja: 選択したテキストを画像としてコピーする

source: Possible typo in “%s”. Did you mean “%s”?
ja: “%s” は誤字の可能性があります。もしかして “%s” ですか?

source: Failed to format while saving document: %s
ja: ドキュメントの保存時に整形に失敗しました: %s

source: Code Actions
ja: コードアクション

source: _Apply
ja: 適用(_A)

source: Loading…
ja: 読み込み中…
ru: Загрузка…

source: No code actions available
ja: 利用可能なコードアクションはありません

source: Code Action Failure
ja: コードアクションの失敗

source: Symbol Not Selected
ja: シンボルが選択されていません

source: A symbol to rename must be selected
ja: 名前を変更するシンボルを選択する必要があります

source: Find References
ja: 参照を検索

source: No references found
ja: 参照が見つかりません

source: The programming language tooling may not support finding references
ja: プログラミング言語のツールは、参照の検索をサポートしていない可能性があります

source: Failed to rename symbol: %s
ja: シンボルの名前変更に失敗しました: %s

source: Rename Symbol
ja: シンボルの名前変更

source: _Rename
ja: 名前の変更(_R)
ru: _Переименовать

source: Current Symbol Name
ja: 現在のシンボル名

source: New Symbol Name
ja: 新しいシンボル名

source: R_ename Symbol…
ja: シンボルの名前変更(_E)…

source: Code Actions…
ja: コードアクション…

source: Display a list of possible code actions from the cursor position
ja: カーソル位置から利用可能なコードアクションの一覧を表示する

source: _Go to Declaration
ja: 宣言へ移動(_G)

source: Jump to file and location where item is declared
ja: アイテムが宣言されているファイルと位置に移動する

source: _Go to Definition
ja: 定義へ移動(_G)
ru: П_ерейти к описанию

source: Jump to file and location where item is defined
ja: アイテムが定義されているファイルと位置に移動する

source: _Find References
ja: 参照を検索(_F)

source: Code Comments
ja: コードコメント

source: _Comment Code
ja: コードのコメント(_C)

source: Add comments surrounding the source code selection
ja: 選択されたソースコードをコメントで囲む

source: Unco_mment Code
ja: コードのコメントを解除(_M)

source: Remove comments from the source code selection
ja: 選択されたソースコードからコメントを削除する

source: Update Copyright before Saving
ja: 保存する前に著作権情報を更新
ru: Обновлять информацию об авторских правах перед сохранением

source: Updates the copyright for the user before saving to disk.
ja: ディスクに保存する前に、ユーザーの著作権情報を更新する。
ru: Обновлять информацию об авторских правах перед сохранением на диск.

source: Update Copyright
ja: 著作権情報を更新
ru: Обновлять информацию об авторских правах

source: Update copyright headers when saving documents
ja: ドキュメント保存時に著作権ヘッダーを更新する

source: Display the project creation guide
ja: プロジェクト作成ガイドを表示する
ru: Показать руководство по созданию проектов

source: Select Location
ja: 場所を選択

source: Failed to Create Project
ja: プロジェクトの作成に失敗

source: Create New Project
ja: 新しいプロジェクトの作成

source: Project Name
ja: プロジェクト名
ru: Имя проекта

source: A subdirectory with this name already exists
ja: この名前のサブディレクトリはすでに存在します

source: A unique name that is used for the project folder and other resources. The name should be in lower case without spaces and should not start with a number.
ja: プロジェクトフォルダーやその他のリソースに使用する一意の名前です。名前は小文字で、空白を含まず、数字で始めてはいけません。

source: Application ID
ja: アプリケーションID
ru: ID приложения

source: A reverse domain-name identifier used to identify the application, such as "org.gnome.Builder". It may not contain dashes.
ja: アプリケーションを識別するのに使用するドメイン名を逆順にした識別子、例えば、"org.gnome.Builder"。ダッシュを含むことはできません。

source: Location
ja: 場所
ru: Расположение

source: The project will be created in a new subdirectory.
ja: プロジェクトは新しいサブディレクトリに作成されます。

source: License
ja: ライセンス
ru: Лицензия

source: Template
ja: テンプレート

source: Create Project
ja: プロジェクトの作成

source: Create _New Project…
ja: 新しいプロジェクトの作成(_N)…

source: Create New Project…
ja: 新しいプロジェクトの作成…

source: Create a new project from template
ja: テンプレートから新しいプロジェクトを作成する

source: Angle
ja: 角度

source: Direction
ja: 方向

source: Shape
ja: 形状

source: Position
ja: 位置

source: Size
ja: サイズ
ru: Размер

source: Stops
ja: 停止

source: Search, autocompletion, and symbol information may be limited until Ctags indexing is complete.
ja: Ctags のインデックス作成が完了するまでは、検索、自動補完、およびシンボル情報が制限される可能性があります。
ru: Поиск, автодополнение и информация о символах ограничена до завершения индексирования Ctags.

source: Indexing Source Code (Paused)
ja: ソースコードのインデックス作成（一時停止中）
ru: Индексирование исходного кода (приостановлено)

source: Suggest Completions
ja: 補完候補を提案

source: Use CTags to suggest code completion proposals
ja: CTags を使用してコード補完候補を提案

source: CTags Path
ja: CTags パス

source: The path to the ctags executable
ja: CTags 実行可能ファイルへのパス

source: Run with Debugger
ja: デバッガーで実行
ru: Запустить с помощью отладчика

source: Run the project with debugger
ja: プロジェクトをデバッガーで実行する

source: Debugger
ja: デバッガー
ru: Отладчик

source: Toggle Breakpoint
ja: ブレークポイントの切り替え

source: Toggle breakpoint at current line
ja: 現在の行でブレークポイントを切り替える

source: Continue
ja: 続行

source: Continue debugging to next breakpoint
ja: 次のブレークポイントまでデバッグを続行する

source: Pause
ja: 一時停止

source: Pause debugger until continued
ja: 続行されるまでデバッガーを一時停止する

source: Step Over
ja: ステップオーバー

source: Execute the current line, stepping over any function calls
ja: 現在の行を実行し、関数呼び出しはステップオーバーする
ru: Выполнить текущую строку, переходя через вызовы функций

source: Step Into
ja: ステップイン

source: Execute the current line, stepping into any function calls
ja: 現在の行を実行し、関数呼び出しに対してステップインする
ru: Выполнить текущую строку, входя внутрь вызовов функций

source: Step Out
ja: ステップアウト

source: Run until the end of the function
ja: 関数の末尾まで実行する
ru: Продолжить до конца функции

source: Breakpoints
ja: ブレークポイント
ru: Точки останова

source: Automatically Break at Program Start
ja: プログラム開始時に自動的にブレーク

source: Automatically Break at Warnings
ja: 警告時に自動的にブレーク

source: Automatically Break at Criticals
ja: クリティカル時に自動的にブレーク

source: File
ja: ファイル
ru: Файл

source: Line
ja: 行
ru: Линия

source: Function
ja: 関数
ru: Функция

source: Address
ja: アドレス
ru: Адрес

source: Type
ja: タイプ
ru: Тип

source: Hits
ja: ヒット
ru: Попадания

source: Expression
ja: 式
ru: Выражение

source: Pause the program (F6)
ja: プログラムを一時停止 (F6)

source: Continue running the program (F5)
ja: プログラムの実行を続行 (F5)

source: Execute the current line, stepping into any function calls (F8)
ja: 現在の行を実行し、関数呼び出しに対してステップイン (F8)

source: Execute the current line, stepping over any function calls (F7)
ja: 現在の行を実行し、関数呼び出しはステップオーバー (F7)

source: Run until the end of the function (Shift+F8)
ja: 現在の関数の終了まで実行 (Shift+F8)

source: Disassembly
ja: 逆アセンブル
ru: Дизассемблерный листинг

source: No break
ja: ブレークしない
ru: Не останавливаться

source: Breakpoint
ja: ブレークポイント
ru: Точка останова

source: Countpoint
ja: カウントポイント
ru: Точка подсчёта

source: Library
ja: ライブラリ
ru: Библиотека

source: Address Range
ja: アドレス範囲
ru: Диапазон адресов

source: Locals
ja: ローカル変数
ru: Локальные переменные

source: Parameters
ja: パラメータ
ru: Параметры

source: Variable
ja: 変数
ru: Переменная

source: Value
ja: 値
ru: Значение

source: Register
ja: レジスタ
ru: Регистр

source: Group
ja: グループ
ru: Группа

source: Thread
ja: スレッド
ru: Поток

source: Frame
ja: フレーム
ru: Панель

source: Arguments
ja: 引数
ru: Аргументы

source: Binary
ja: バイナリ
ru: Файл

source: Threads
ja: スレッド
ru: Потоки

source: Registers
ja: レジスタ
ru: Регистры

source: Console
ja: コンソール
ru: Консоль

source: Stop After Launching Program
ja: プログラム起動後にブレーク

source: Automatically insert a breakpoint at the start of the application
ja: アプリケーション開始時に自動的にブレークポイントを挿入する

source: Stop at Warnings
ja: 警告で停止

source: Automatically insert a breakpoint on warning logs
ja: 警告ログ発生時に自動的にブレークポイントを挿入する

source: Stop at Criticals
ja: クリティカルで停止

source: Automatically insert a breakpoint on critical logs
ja: クリティカルログ発生時に自動的にブレークポイントを挿入する

source: The device address
ja: デバイスのアドレス

source: The device port number
ja: デバイスのポート番号

source: The application to run
ja: 実行するアプリケーション

source: A PTY to bidirectionally proxy to the device
ja: デバイスへの双方向プロキシ用疑似端末

source: Number of seconds to wait for the deviced peer to appear
ja: デバイスのピアが現れるまでの待機秒数

source: D-Bus Inspector…
ja: D-Bus インスペクタ…
ru: Инспектор D-Bus…

source: Dub Run
ja: Dub 実行

source: No file was provided.
ja: ファイルが指定されていません。
ru: Файл не был предоставлен.

source: Use minimal editor interface
ja: 最小限のエディターインターフェースを使用する
ru: Использовать минимальный интерфейс редактора

source: Switch to %s style
ja: スタイルを %s に切り替える

source: Switch application and editor theme
ja: アプリケーションとエディターのテーマを切り替える

source: Reverts language preferences to application defaults
ja: 言語設定をアプリケーション既定値に戻す

source: Plain Text
ja: プレーンテキスト

source: Spaces
ja: スペース
ru: Пробелы

source: Tabs
ja: タブ
ru: Табуляция

source: Go
ja: 移動

source: Go to Line
ja: 指定行へ移動
ru: Перейти к строке

source: Indentation
ja: インデント
ru: Отступ

source: Indent Using Spaces
ja: スペースでインデントする

source: Spaces per Tab
ja: タブごとのスペース数

source: Indentation Size
ja: インデントサイズ

source: Same as Tab Width
ja: タブ幅と同じ

source: Line Ending
ja: 改行コード

source: New Editor Workspace…
ja: 新規エディターワークスペース…
ru: Новое рабочее пространство редактора…

source: New _File
ja: 新しいファイル(_F)
ru: Новый _файл

source: _Open File…
ja: ファイルを開く(_O)…
ru: _Открыть файл…

source: Open in New Frame
ja: 新しいフレームで開く
ru: Открыть в новой панели

source: Open in New Workspace…
ja: 新しいワークスペースで開く…

source: Save _As
ja: 名前を付けて保存(_A)
ru: Сохранить _как

source: Find…
ja: 検索…

source: Find/Replace…
ja: 検索/置換…

source: Print…
ja: 印刷…
ru: Печать…

source: Format Document
ja: ドキュメントを整形

source: Format Selection
ja: 選択範囲を整形

source: Move to Previous Diagnostic
ja: 前の診断に移動

source: Move the insertion cursor to the previous diagnostic location
ja: 挿入カーソルを前の診断位置に移動する

source: Move to Next Diagnostic
ja: 次の診断に移動

source: Move the insertion cursor to the next diagnostic location
ja: 挿入カーソルを次の診断位置に移動する

source: Programming Languages
ja: プログラミング言語
ru: Языки программирования

source: Settings provided by .editorconfig and modelines take precedence over those below.
ja: .editorconfig および modelines によって提供される設定は、以下の設定よりも優先されます。

source: Indentation & Formatting
ja: インデントとフォーマット

source: Tab Character
ja: タブ文字

source: The character to be inserted for Tab
ja: タブで挿入される文字

source: Tab
ja: タブ

source: Insert Trailing Newline
ja: 末尾に改行を挿入
ru: Вставка завершающего перевода строки

source: Ensure files end with a newline
ja: ファイルの末尾が改行で終わるようにする
ru: Всегда заканчивать файлы переводом строки

source: Trim Trailing Space
ja: 末尾の空白を削除

source: Upon saving, trailing whitespace from modified lines will be trimmed
ja: 保存時、変更された行の末尾の空白は削除されます

source: Auto Indent
ja: 自動インデント

source: Automatically indent source code as you type
ja: 入力時、ソースコードは自動でインデントされます

source: Tab Size
ja: タブ幅

source: The number of characters to indent for Tab
ja: タブでインデントする文字数

source: The number of characters to indent, or -1 to use tab size
ja: タブでインデントする文字数（-1 の場合、タブ幅を使用）

source: Margin
ja: マージン

source: Show Right Margin
ja: 右マージンを表示

source: Display a margin in the editor to indicate maximum desired width
ja: エディター内に望ましい最大幅を示すマージンを表示する

source: Right Margin Position
ja: 右マージンの位置

source: The desired maximum line length
ja: 望ましい行の最大長

source: Behavior
ja: 振る舞い

source: Overwrite Braces
ja: 波カッコを上書き
ru: Замена скобок

source: Overwrite closing braces, brackets, parenthesis, and quotes
ja: 閉じ波カッコ、角カッコ、丸カッコ、および引用符を上書きする

source: Insert Matching Brace
ja: 波カッコに対応する文字を挿入する
ru: Вставка парных скобок

source: Insert matching character for braces, brackets, parenthesis, and quotes
ja: 波カッコ、角カッコ、丸カッコ、および引用符に対応する文字を挿入する

source: Space before opening parentheses
ja: 開き丸カッコの前に空白を挿入する
ru: Пробел перед открывающими круглыми скобками

source: Space before opening brackets
ja: 開き角カッコの前の空白を挿入する
ru: Пробел перед открывающими квадратными скобками

source: Space before opening braces
ja: 開き波カッコの前に空白を挿入する
ru: Пробел перед открывающими фигурными скобками

source: Space before opening angles
ja: 開き山カッコの前の空白を挿入する
ru: Пробел перед открывающими угловыми скобками

source: Prefer a space before colon
ja: コロンの前に空白を挿入する

source: Prefer a space before commas
ja: コンマの前に空白を挿入する
ru: Предпочитать пробел перед запятыми

source: Prefer a space before semicolons
ja: セミコロンの前に空白を挿入する
ru: Предпочитать пробел перед точками с запятой

source: Color
ja: 色

source: Fonts & Styling
ja: フォントとスタイリング

source: Preview
ja: プレビュー

source: Custom Font
ja: カスタムフォント

source: Adjust spacing between lines
ja: 行間を調整する

source: How text should be wrapped when wider than the frame
ja: フレームよりも幅が広い場合のテキスト折り返し方法

source: At Spaces
ja: 空白で折り返す

source: Anywhere
ja: 任意の位置で折り返す

source: Background Pattern
ja: 背景パターン

source: Show a background pattern underneath source code
ja: ソースコードの下に背景パターンを表示する

source: No Pattern
ja: パターン無し

source: Grid Lines
ja: グリッド線

source: Scrollbars
ja: スクロールバー

source: Source Code Overview
ja: ソースコード概要

source: Display an overview of source code next to the editor
ja: エディターの隣にソースコードの概要を表示する

source: Prefer Scrollbars
ja: スクロールバーを優先

source: Always On
ja: 常にオン

source: Automatic
ja: 自動

source: Line Numbers
ja: 行番号

source: Show Line Numbers
ja: 行番号を表示

source: Display line numbers next to each line of code
ja: コードの各行の横に行番号を表示する

source: Use Relative Line Numbers
ja: 相対行番号を使用

source: Show line numbers relative to the current line
ja: カーソル行を基準に相対行番号を表示する

source: Show Diagnostics
ja: 診断を表示

source: Display diagnostics next to the line number
ja: 行番号の横に診断を表示する

source: Show Line Changes
ja: 変更行を表示

source: Highlight changed lines next to the line number
ja: 行番号の横に変更された行を強調表示する

source: Use Line Selection Styling
ja: 行選択スタイリングを使用

source: Use selection styling for line numbers if whole line is selected
ja: 行全体が選択された場合、行番号に選択スタイリングを適用する

source: Highlighting
ja: ハイライト
ru: Подсветка

source: Highlight Current Line
ja: 現在行をハイライト

source: Make the current line stand out with highlights
ja: 現在の行を強調表示する

source: Highlight Matching Brackets
ja: 対応するカッコをハイライト

source: Use cursor position to highlight matching brackets, braces, parenthesis, and more
ja: カーソルの位置をもとに、対応するカッコ、波カッコ、丸カッコなどを強調表示する

source: Semantic Highlighting
ja: セマンティックハイライト
ru: Подсветка семантики

source: Use symbol information to highlight namespaces, functions, and variables within source code
ja: シンボル情報を使用して、ソースコード内の名前空間、関数、変数を強調表示する

source: Draw a mark representing normal spaces
ja: 通常のスペースを表す記号を描画する

source: Draw a mark representing tabs
ja: タブを表す記号を描画する

source: Newlines
ja: 改行

source: Draw a mark at the end of lines
ja: 行末を表す記号を描画する

source: Non-breaking spaces
ja: 非改行スペース
ru: Неразрывные пробелы

source: Draw a mark at non-breaking space characters
ja: 非改行スペースを描画する

source: Leading
ja: 行頭の空白

source: Draw marks for leading spaces only
ja: 行頭の空白のみを描画する

source: Inside Text
ja: テキスト内

source: Draw marks inside a line of text only
ja: テキスト内でのみ記号を描画する

source: Trailing
ja: 行末の余分な空白

source: Draw marks for trailing spaces only
ja: 行末の余分な空白のみを描画する

source: Spelling
ja: スペルチェック
ru: Проверка правописания

source: Underline potential spelling mistakes as you type
ja: 入力中に潜在的なスペルミスに下線を引く

source: Selections
ja: 選択

source: Minimum Characters to Highlight
ja: ハイライトする最小文字数

source: The minimum selection length before highlighting matches
ja: 一致する文字列を強調表示する前の最小選択文字数

source: Snippets
ja: スニペット
ru: Фрагменты текста

source: Expand Snippets
ja: スニペットを展開

source: Use “Tab” to expand configured snippets in the editor
ja: エディター内で設定済みのスニペットを展開するには「Tab」キーを使用する

source: Code Completion
ja: コード補完

source: Completion Proposals
ja: コード補完候補

source: Suggest Code Completions
ja: コード補完を提案

source: Automatically suggest code completions while typing
ja: 入力中に自動的にコード補完を提案する

source: Select First Completion Proposal
ja: 最初のコード補完候補を選択

source: Automatically select the first completion proposal when displayed
ja: 表示されたときに最初のコード補完候補を自動的に選択する

source: Maximum Completion Proposals
ja: コード補完候補の最大数

source: The maximum number of completion rows that will be displayed at once
ja: 一度に表示されるコード補完候補の最大行数

source: Movements
ja: 移動

source: Backspace will remove extra space to keep you aligned with your indentation
ja: 「バックスペース」はインデントに合わせて余分な空白を削除する
ru: Клавиша Backspace будет удалять дополнительное пространство, чтобы держать курсор в соответствии с отступом

source: Navigate to non-space characters
ja: 空白以外の文字に移動する

source: Before line boundaries
ja: 行境界の直前

source: After line boundaries
ja: 行境界の直後

source: Instead of line boundaries
ja: 行境界の代わり

source: Disabled
ja: 無効

source: Session Management
ja: セッション管理

source: Save & Restore
ja: 保存と復元

source: Auto-Save
ja: 自動保存

source: Regularly save the document as you type
ja: 入力中にドキュメントを定期的に保存する

source: Auto-Save Delay
ja: 自動保存の遅延

source: The delay in seconds to wait before auto-saving the document
ja: ドキュメントを自動保存する前に待機する秒数

source: Format on Save
ja: 保存時に整形

source: Reformat sources when saving to disk. Requires a registered formatter for the source language.
ja: ディスクに保存する際にソースを整形する。ソース言語に対応した登録済みのフォーマッターが必要です。

source: Restore Cursor Position
ja: カーソル位置を復元

source: Jump to the last position when re-opening a file
ja: ファイルを再度開いた際に、最後の位置へジャンプする

source: Open file or folder
ja: ファイルまたはフォルダーを開く

source: Similar Files (Ctrl+Shift+O)
ja: 類似ファイル (Ctrl+Shift+O)

source: Installation failed
ja: インストールに失敗しました
ru: Установка завершилась неудачно

source: Installation complete
ja: インストールが完了しました
ru: Установка завершена

source: The client has been closed
ja: クライアントが閉じられました
ru: Клиент был закрыт

source: Failed to remove flatpak manifest: %s
ja: Flatpak マニフェストの削除に失敗しました: %s
ru: Не удалось удалить манифест flatpak: %s

source: Network is not available, skipping downloads
ja: ネットワークが利用できないため、ダウンロードをスキップします
ru: Сеть недоступна, отмена загрузок

source: Install or Update SDK?
ja: SDK をインストールまたは更新しますか?
ru: Установить или обновить SDK?

source: Builder needs to install the following software development kits to build your project.
ja: ビルダーはプロジェクトをビルドするために、以下のソフトウェア開発キットをインストールする必要があります。
ru: Builder должен установить следующие инструментарии разработки для построения вашего проекта.

source: Name
ja: 名称
ru: Имя

source: Architecture
ja: アーキテクチャ
ru: Архитектура

source: Resolving SDK Extensions
ja: SDK拡張機能の解決中

source: Builder is locating the appropriate SDK extensions to build your project
ja: ビルダーはプロジェクトをビルドするために、適切な SDK 拡張機能を探しています

source: Creating flatpak workspace
ja: Flatpak ワークスペースを作成中
ru: Создание рабочего пространства для flatpak

source: Removing stale flatpak staging directory: %s
ja: 古い Flatpak ステージングディレクトリを削除中: %s

source: Preparing build directory
ja: ビルドディレクトリを準備中
ru: Подготовка директории сборки

source: Downloading dependencies
ja: 依存関係をダウンロード中
ru: Загрузка зависимостей

source: Building dependencies
ja: 依存関係をビルド中
ru: Построение зависимостей…

source: Finalizing flatpak build
ja: Flatpak ビルドをファイナライズ中
ru: Завершение сборки flatpak

source: Exporting staging directory
ja: ステージングディレクトリをエクスポート中
ru: Экспорт промежуточного каталога

source: Creating flatpak bundle
ja: Flatpak バンドルを作成中
ru: Создание пакета flatpak

source: Flatpak Application
ja: Flatpak アプリケーション

source: Installing Necessary SDKs
ja: 必要な SDK をインストール中
ru: Установка необходимых SDK

source: Builder is installing Software Development Kits necessary for building your application.
ja: ビルダーはアプリケーションのビルドに必要なソフトウェア開発キットをインストールしています。
ru: Builder устанавливает комплекты для разработки программного обеспечения (Software Development Kits), необходимые для создания вашего приложения.

source: Failed to update SDKs: %s
ja: SDK の更新に失敗しました: %s
ru: Не удалось обновить SDK: %s

source: Updating Necessary SDKs
ja: 必要な SDK を更新中
ru: Обновление необходимых SDK

source: Builder is updating Software Development Kits necessary for building your application.
ja: ビルダーはアプリケーションのビルドに必要なソフトウェア開発キットを更新しています。
ru: Builder обновляет комплекты разработки программного обеспечения, необходимые для создания вашего приложения.

source: Updating SDK Runtime
ja: SDK ランタイムを更新中
ru: Обновление SDK Runtime

source: Flatpak installation for new SDKs
ja: 新しい SDK 用の Flatpak をインストール

source: The Flatpak installation to use for new SDKs and SDK extensions.
ja: 新しい SDK および SDK 拡張機能用の Flatpak をインストール。

source: Preferred Flatpak Installation
ja: 推奨 Flatpak をインストール

source: When installing SDKs and SDK extensions, Builder may prefer a specific Flatpak installation which contains the extension.
ja: SDK および SDK 拡張機能をインストールする際、ビルダーは拡張機能が含まれている特定の Flatpak インストールを優先する場合があります。
