Repository: GNOME/gnome-builder
Catalog: po/*.po
Languages: ja, ru

source: Builder
ja: ビルダー

source: Create applications for GNOME
ja: GNOME向けアプリケーションを作成する

source: Builder is an actively developed Integrated Development Environment for GNOME. It combines integrated support for essential GNOME technologies such as GTK+, GLib, and GNOME APIs with features that any developer will appreciate, like syntax highlighting and snippets.
ja: ビルダーは、GNOME 向けの統合開発環境 (IDE) として活発に開発が進められています。GTK+、GLib、GNOME API といった必須の GNOME テクノロジーへの統合サポートに加え、シンタックスハイライトやスニペットなど、あらゆる開発者にとって有用な機能を備えています。
ru: Builder является активно развиваемой интегрированной средой разработки для GNOME. Приложение сочетает в себе встроенную поддержку основных технологий GNOME таких как GTK+, Glib и GNOME APIs, с функциями которые оценит любой разработчик, такими как подсветка синтаксиса и автодополнение фрагментов текста.

source: You can rely on predictable releases of Builder with each new release of GNOME every six months.
ja: 6ヶ月ごとの GNOME の新しいリリースと合わせて、ビルダーも予測可能なリリースが行われるため安心して利用できます。
ru: Вы можете рассчитывать на постоянные выпуски приложения Builder с новым выпуском GNOME каждые шесть месяцев.

source: Features:
ja: 機能:
ru: Особенности:

source: Built in syntax highlighting for many languages
ja: 多くの言語に対応した組み込みの構文ハイライト
ru: Встроенная подсветка синтаксиса для многочисленных языков

source: Side-by-side code editors
ja: サイド・バイ・サイドのコードエディター
ru: Многооконный редактор кода

source: Multi-monitor support
ja: マルチモニターのサポート
ru: Поддержка нескольких мониторов

source: Code overview mini-map
ja: コード概要ミニマップ
ru: Показывать обзорную мини-карту

source: Integration with Git
ja: Gitとの統合
ru: Интеграция с Git

source: Integration with Autotools, Cargo, CMake, Gradle, Meson, Maven, Make, PHPize, and Waf
ja: Autotools、Cargo、CMake、Gradle、Meson、Maven、Make、PHPize、および Waf との統合
ru: Интеграция с Autotools, Cargo, CMake, Gradle, Meson, Maven, Make, PHPize и Waf

source: Clang based auto-completion, semantic highlighting, and diagnostics
ja: Clang に基づく自動補完、セマンティックハイライト、および診断機能
ru: Автодополнение на основе Clang, семантическая подсветка, и диагностика

source: Python based auto-completion, semantic highlighting, and diagnostics
ja: Python に基づく自動補完、セマンティックハイライト、および診断機能
ru: Автодополнение на основе Python, семантическая подстветка, и диагностика

source: Vala based auto-completion and diagnostics
ja: Vala に基づく自動補完および診断機能
ru: Автодополнение на основе Vala и диагностика

source: Auto indentation support for C, Python, Vala, and XML
ja: C、Python、Vala、および XML 用の自動インデント機能
ru: Поддержка автоматических отступов для C, Python, Vala, и XML

source: HTML, Markdown, and reStructuredText, and Sphinx live preview
ja: HTML、Markdown、reStructuredText、および Sphinx のライブプレビュー
ru: Предпросмотр HTML, Markdown и reStructuredText в режиме реального времени

source: Optional Vim, Emacs, and SublimeText style editing
ja: Vim、Emacs、および SublimeText スタイルの編集（オプション）
ru: Возможность редактирования в стиле Vim, Emacs и Sublime Text

source: An integrated software profiler for native applications
ja: ネイティブアプリケーション向けの統合ソフトウェアプロファイラ
ru: Интегрированное программное обеспечение профайлера для собственных приложений

source: An integrated debugger for native applications
ja: ネイティブアプリケーション向けの統合デバッガー
ru: Интегрированный отладчик для приложений

source: Support for building with jhbuild and flatpak runtimes
ja: jhbuild および Flatpak ランタイムを用いたビルドのサポート
ru: Поддержка построения с помощью jhbuild и flatpak

source: Support for viewing TODOs found within your code base
ja: コードベース内に見つかった TODO の表示サポート
ru: Поддержка просмотра TODO, найденных в вашем проекте

source: Fast fuzzy text search across files and symbols
ja: ファイルおよびシンボルを横断する高速ファジーテキスト検索
ru: Быстрый поиск нечёткого текста по файлам и символам

source: Arduino integration with arduino-cli
ja: arduino-cli を用いた Arduino 統合

source: Debug with the GNU debugger
ja: GNU デバッガーを用いたデバッグ
ru: Отладка с отладчиком GNU

source: Quickly access your projects
ja: プロジェクトへの素早いアクセス
ru: Быстрый доступ к вашим проектам

source: Create new projects from a variety of templates
ja: さまざまなテンプレートから新規プロジェクトを作成
ru: Создавайте новые проекты из различных шаблонов

source: Integration with Git to clone your projects
ja: Gitとの統合によるプロジェクトのクローン作成
ru: Интеграция с Git для клонирования ваших проектов

source: The source code editor
ja: ソースコードエディター
ru: Редактор исходного кода

source: Fast global fuzzy search
ja: 高速なグローバルファジー検索
ru: Быстрый глобальный поиск

source: Use the minimap to see more of the file
ja: ミニマップを使用すると、ファイルの全体像が見渡せます
ru: Использовать мини-карту для более полного просмотра содержимого файл

source: Build Parallelism
ja: 並行ビルド
ru: Параллельная сборка

source: Number of workers to use when performing builds. -1 for sensible default. 0 for number of CPU.
ja: ビルド実行時に使用するワーカーの数。デフォルトは -1 です。CPU 数は 0。
ru: Количество рабочих потоков, используемых для сборки. «-1» — значение по умолчанию. «0» — означает число процессоров.

source: Clear build logs
ja: ビルドログをクリア
ru: Очистить журналы сборки

source: If enabled, build log pane will be cleared on rebuild.
ja: 有効な場合、再ビルド時にビルドログペインがクリアされます。
ru: Если этот параметр включён, журнала сборки будет очищен при пересборке.

source: Show Log When Building
ja: ビルド時にログを表示

source: If enabled, the build log will be raised when a build starts
ja: 有効な場合、ビルド開始時にビルドログが最前面に表示されます

source: Allow network when metered
ja: 従量課金時にネットワークを許可
ru: Разрешить доступ к сети на лимитных соединениях

source: Enable automated transfers upon building such as SDK downloads and dependencies when connection is metered.
ja: 接続が従量課金制の時でも、ビルド時に SDK のダウンロードや依存関係などの自動転送を有効にする。
ru: Включить автоматические загрузки при построении, такие как загрузки SDK и зависимостей, на лимитных соединениях.

source: Ctags based autocompletion
ja: Ctags に基づく自動補完
ru: Автодополнение на основе Ctags

source: Use Ctags for autocompletion.
ja: 自動補完に Ctags を使用する。
ru: Использовать Ctags для автодополнения.

source: Enable semantic highlighting
ja: セマンティックハイライトを有効にする
ru: Включить подсветку семантики

source: If enabled, additional highlighting will be provided in supported languages based on information extracted from the source code.
ja: 有効にすると、ソースコードから抽出された情報に基づいて、サポートされている言語で追加のハイライトが提供されます。
ru: Если этот параметр включён, будет предоставляться дополнительная подстветка для поддерживаемых языков, на основе информации полученной из исходного кода.

source: Path to ctags executable
ja: ctags 実行可能ファイルへのパス
ru: Путь к исполняемым файлам ctag

source: The path to the ctags executable on the system.
ja: システム上の ctags 実行可能ファイルへのパス。
ru: Путь к исполняемым файлам ctag в системе.

source: Debugger Breakpoint at Main
ja: main でのデバッガーブレークポイント

source: Debugger should automatically insert breakpoint at main() function.
ja: デバッガーは main() 関数に自動的にブレークポイントを挿入します。

source: Debugger Breakpoint at Criticals
ja: critical でのデバッガーブレークポイント

source: Debugger should automatically insert breakpoint at g_critical() function.
ja: デバッガーは g_critical() 関数に自動的にブレークポイントを挿入します。

source: Debugger Breakpoint at Warnings and Criticals
ja: warning および critical でのデバッガーブレークポイント

source: Debugger should automatically insert breakpoint at g_warning() and g_critical function.
ja: デバッガーは、g_warning() および g_critical() 関数に自動的にブレークポイントを挿入します。

source: Restore last position
ja: 最後の位置を復元
ru: Восстановить последнюю позицию

source: Jump to the last position when reopening a file
ja: ファイルを再度開いたとき、最後の位置にジャンプする
ru: Перейти к последней позиции при повторном открытии файла

source: Show modified lines
ja: 変更された行を表示
ru: Показывать измененные строки

source: If enabled, the editor will show line additions and changes next to the source code.
ja: 有効にすると、エディターはソースコードの横に追加された行および変更された行を表示します。
ru: Если этот параметр включён, редактор покажет изменения и дополнения рядом с исходным кодом.

source: Show diagnostics next to line number
ja: 行番号の隣に診断を表示
ru: Показывать диагностику рядом с номером строки

source: If enabled, the editor will show diagnostics to the left to the line numbers.
ja: 有効にすると、エディターは行番号の左側に診断を表示します。
ru: Если этот параметр включён, редактор будет показывать диагностику слева от номера строки.

source: Highlight current line
ja: 現在の行をハイライト
ru: Подсвечивать текущую строку

source: If enabled, the editor will highlight the line containing the cursor.
ja: 有効にすると、エディターはカーソルがある行を強調表示します。
ru: Если это параметр включен, редактор будет подсвечивать строку в которой находится курсор.

source: Highlight matching brackets
ja: 対応するカッコをハイライト
ru: Подсвечивать парные скобки

source: If enabled, the editor will highlight matching brackets.
ja: 有効にすると、エディターは対応するカッコを強調表示します。
ru: Если этот параметр включён, редактор будет подсвечивать парные скобки.

source: Show line numbers
ja: 行番号を表示
ru: Показывать номера строк

source: If enabled, the editor will show line numbers.
ja: 有効にすると、エディターは行番号を表示します。
ru: Если этот параметр включён, редактор будет показывать номера строк.

source: Show relative line numbers
ja: 相対行番号を表示
ru: Показывать относительные номера строк

source: If enabled, the editor will show relative line numbers.
ja: 有効にすると、エディターは相対行番号を表示します。
ru: Если этот параметр включён, редактор будет показывать относительные номера строк.

source: Use line selection styling
ja: 行選択のスタイルを使用

source: If enabled, the editor will use selected style for line numbers for whole lines selected.
ja: 有効にすると、エディターは行全体が選択されている行の行番号に、行選択のスタイルを適用します。

source: Smart Backspace
ja: スマートバックスペース
ru: Умная кнопка Backspace

source: Backspace will remove additional spaces to keep you aligned to the indentation size.
ja: バックスペースは、インデント幅に合わせて余分なスペースを削除します。
ru: Клавиша Backspace будет удалять дополнительные пробелы, чтобы удерживать курсор в пределах отступа.

source: Smart Home/End
ja: スマート Home/End

source: Modifies the behavior of Home/End keys.
ja: Home/End キーの動作を変更します。

source: Show grid lines
ja: グリッド線を表示
ru: Показывать сетку

source: If enabled, the editor will show grid lines in the document.
ja: 有効にすると、エディターはドキュメントにグリッド線を表示します。
ru: Если этот параметр включён, редактор будет показывать сетку документа.

source: If enabled, the editor will respect the font-name setting.
ja: 有効にすると、エディターは font-name 設定を尊重します。

source: This setting is only respected if the use-custom-font setting is enabled.
ja: この設定は、use-custom-font 設定が有効な場合にのみ尊重されます。

source: Overview Map Policy
ja: 概要マップポリシー

source: When the overview map should be displayed.
ja: 概要マップが表示されるタイミング。

source: Draw Spaces
ja: 空白の表示
ru: Отображение пробелов

source: The various types of space to draw in the editor.
ja: エディターで表示する空白の種類。
ru: Отображать в редакторе различные варианты пробелов.

source: Wrap Text
ja: テキストを折り返す
ru: Перенос текста

source: The way to wrap a long line of text for a better visibility.
ja: より見やすくするために、長いテキスト行を折り返す方法。
ru: Способ складывания длинной строки текста для лучшей видимости.

source: Autosave Enabled
ja: 自動保存を有効にする
ru: Автосохранение включено

source: Enable or disable autosave feature.
ja: 自動保存機能を有効または無効にします。
ru: Включить или выключить функцию автосохранения.

source: Autosave Frequency
ja: 自動保存間隔
ru: Частота автосохранения

source: The number of seconds after modification before auto saving.
ja: 変更後に自動保存が行われるまでの秒数。
ru: Число секунд после изменения перед автосохранением.

source: Completion Row Count
ja: 補完行数
ru: Число строк автодополнения

source: The number of completion rows to display to the user.
ja: ユーザーに表示する補完行数。
ru: Количество строк автодополнения, которые будут показаны пользователю.

source: Line Height
ja: 行の高さ

source: The line height to use for the selected font.
ja: 選択されたフォントで使用する行の高さ。

source: Interactive Completion
ja: 対話型補完
ru: Интерактивные автодополнения

source: If enabled, Builder will automatically display completion proposals as you type.
ja: 有効にすると、ビルダーは入力時に自動的に補完候補を表示します。
ru: Если этот параметр включён, Builder будет автоматически показывать автодополнения в процессе написания.

source: Minimum characters for matching selection.
ja: 一致選択の最小文字数。
ru: Минимальное количество символов для подбора соответствия.

source: Specify the minimum number of characters for selection matching.
ja: 一致選択の最小文字数を指定します。
ru: Укажите минимальное количество символов для подбора соответствия.

source: Enable Snippets
ja: スニペットを有効にする

source: Allow expanding snippets from the editor by pressing tab after the snippet trigger.
ja: スニペットトリガー入力後にタブキーを押すことで、エディター上でスニペットの展開を許可します。

source: Select First Completion
ja: 最初の補完を選択する

source: Automatically select the first auto-completion entry.
ja: 自動補完の最初の候補を自動的に選択する。

source: Spaces Style
ja: 空白のスタイル
ru: Стиль пробелов

source: How to apply spaces when reformatting text.
ja: テキスト整形時に空白を適用する方法。
ru: Как использовать пробелы при форматировании текста.

source: Enabled
ja: 有効
ru: Включено

source: If the type within the extension is enabled.
ja: 拡張内のタイプが有効な場合。
ru: Если тип внутри расширения включен.

source: Window size
ja: ウィンドウサイズ
ru: Размер окна

source: Window size (width and height).
ja: ウィンドウサイズ（幅と高さ）
ru: Размер окна (ширина и высота).

source: Window maximized
ja: ウィンドウ最大化
ru: Развернутое окно

source: Window maximized state
ja: ウィンドウの最大化状態
ru: Состояние развернутого окна

source: Style Variant
ja: スタイル・バリアント
ru: Вариант стиля

source: Use the light or dark variant of the GTK theme and/or GtkSourceView style scheme.
ja: GTK テーマおよび / または GtkSourceView スタイルスキームのライトまたはダークバリアントを使用します。
ru: Используйте светлый или тёмный вариант темы GTK и/или схемы стиля GtkSourceView.

source: Projects directory
ja: プロジェクトディレクトリ
ru: Директория проектов

source: Directory for all Builder projects.
ja: すべてのビルダープロジェクトのディレクトリ。
ru: Директория для всех проектов приложения Builder.

source: Restore Session
ja: セッションを復元する

source: Restores the projects previous session when loading.
ja: 読み込み時にプロジェクトの前回のセッションを復元します。

source: Clear build caches at startup
ja: 起動時にビルドキャッシュをクリアする
ru: Очищать кэши сборки при запуске

source: If enabled, Builder will clear build caches upon startup.
ja: 有効にすると、ビルダーは起動時にビルドキャッシュをクリアします。
ru: Если этот параметр включён, Builder будет очищать кэши сборки при запуске.

source: The interface style to change pages
ja: ページ切替用のインターフェーススタイル

source: Default License
ja: 既定のライセンス

source: The default license to use for new projects
ja: 新しいプロジェクトで使用する既定のライセンス

source: Inherit Language Server stderr
ja: 言語サーバの標準エラー出力を継承する

source: If enabled, stderr of language servers will be redirected to the console.
ja: 有効にすると、言語サーバーの標準エラー出力がコンソールにリダイレクトされます。

source: Preview Search Results
ja: 検索結果のプレビュー

source: If previews for search results should be automatically displayed
ja: 検索結果のプレビューを自動的に表示する場合

source: Plugin enabled
ja: プラグインが有効
ru: Плагин включен

source: If the plugin should be enabled
ja: プラグインを有効にする場合
ru: Если плагин должен быть включён

source: Show Icons
ja: アイコンを表示する
ru: Показывать значки

source: This setting is deprecated and no longer in use.
ja: この設定は非推奨で、もはや使用されていません。
ru: Этот параметр устарел и более не используется.

source: Show Ignored Files
ja: 無視されたファイルを表示する
ru: Показывать проигнорированные файлы

source: If enabled, the project tree will display files that are ignored by the VCS.
ja: 有効にすると、プロジェクトツリーにVCSによって無視されるファイルが表示されます。
ru: Если этот параметр включён, в дереве проекта будут отображаться файлы, которые игнорируются VCS.

source: Sort Directories First
ja: ディレクトリを先頭に表示する
ru: Сначала директории

source: If enabled, the project tree will sort directories before regular files.
ja: 有効にすると、プロジェクトツリーではディレクトリが通常のファイルよりも先に並べ替えられます。
ru: Если этот параметр включён, в дереве проекта директории будут отображаться перед обычными файлами.

source: Selected configuration for building
ja: 選択されたビルド構成
ru: Выбранная конфигурация для сборки

source: The configuration that has been selected and will be restored the next time the project loads.
ja: 選択された構成は、次回プロジェクトが読み込まれる際に復元されます。
ru: Конфигурация, которая была выбрана, и которая будет восстановлена в следующий раз при загрузке проекта.

source: Install Project Before Running
ja: 実行前にプロジェクトをインストールする

source: Run the pipelines install phase before running the project. Only use this if you know what you're doing with your project.
ja: プロジェクトを実行する前に、パイプラインのインストールフェーズを実行します。このオプションは、プロジェクトで行う処理内容を十分に理解している場合にのみ使用してください。

source: Default Run Command
ja: 既定の実行コマンド

source: The id of the default run command
ja: 既定の実行コマンドの ID

source: The signal to send the app to stop
ja: アプリを停止するためのシグナル

source: This allows sending something other than sigkill to stop the target application. That might be useful when you want to gracefully shutdown a server process.
ja: これにより、対象のアプリケーションを停止する際に、SIGKILL以外のシグナルを送信できます。これは、サーバープロセスを正常にシャットダウンしたい場合に有用です。

source: Unit Test Locality
ja: ユニットテストのローカリティ

source: What environment to use when running unit tests
ja: ユニットテストを実行するのに使用する環境

source: Verbose Logging
ja: 詳細なログ出力

source: If G_MESSAGES_DEBUG=all should be used when running the target application
ja: 対象アプリケーションを実行する際に、G_MESSAGES_DEBUG=all を使用する場合

source: Cache Root
ja: キャッシュのルート

source: A directory to use as the root for cache data of the project like builds and flatpak staging directories
ja: ビルドや Flatpak のステージングディレクトリなど、プロジェクトのキャッシュデータ用のルートディレクトリ

source: Check Spelling
ja: スペルチェック

source: Automatically check spelling within documents
ja: ドキュメント内のスペルチェックを自動で行う

source: Build software for GNOME
ja: GNOME向けソフトウェアをビルドする
ru: Сборка программного обеспечения для GNOME

source: Build;Develop;
ja: Build;Develop;ビルド;開発;

source: Open a Project
ja: プロジェクトを開く
ru: Открыть проект

source: Start New Project
ja: 新しいプロジェクトを開始
ru: Начать новый проект

source: Clone Repository
ja: リポジトリをクローン
ru: Клонировать репозиторий

source: New Editor Workspace
ja: 新規エディターワークスペース
ru: Новое рабочее пространство

source: unsaved file %u
ja: 未保存ファイル %u
ru: несохранённый файл %u

source: The current language lacks a symbol resolver.
ja: 現在の言語には、シンボルリゾルバがありません。
ru: В текущем языке отсутствует распознаватель символов.

source: %s contained invalid ASCII
ja: 「%s」には無効なASCII文字が含まれています
ru: %s содержит недопустимый ASCII

source: Failed to parse integer from “%s”
ja: “%s”から整数の解析に失敗しました
ru: Не удалось разобрать целое число из «%s»

source: language defaults missing version in [global] group.
ja: [global] グループ内の言語既定値に、バージョンが指定されていません。
ru: отсутствует версия языка по умолчанию в группе [global].

source: Failed to initialize defaults.
ja: 既定値の初期化に失敗しました。
ru: Не удалось инициализировать значения по умолчанию.

source: Failed to save draft: %s
ja: 下書きの保存に失敗しました: %s
ru: Не удалось сохранить черновик: %s

source: Untitled
ja: 無題
ru: Безымянный

source: Projects
ja: プロジェクト
ru: Проекты

source: _Cancel
ja: キャンセル(_C)
ru: _Отмена

source: A suitable debugger could not be found.
ja: 適切なデバッガーが見つかりませんでした。

source: Open File…
ja: ファイルを開く…
ru: Открыть файл…

source: Open a file in the workspace
ja: ワークスペース内のファイルを開く

source: Preferences
ja: 設定
ru: Параметры

source: Keyboard Shortcuts
ja: キーボードショートカット
ru: Комбинации клавиш

source: Help
ja: ヘルプ
ru: Справка

source: About Builder
ja: ビルダーについて
ru: О программе

source: _Quit
ja: 終了(_Q)
ru: _Завершить

source: Document
ja: ドキュメント
ru: Дкумент

source: Application
ja: アプリケーション

source: Pages
ja: ページ

source: Text Editor
ja: テキストエディター

source: Search & Replace
ja: 検索と置換

source: Documents
ja: ドキュメント

source: Selection
ja: 選択
ru: Выделение

source: Printing
ja: 印刷

source: _Discard Changes and Reload
ja: 変更を破棄して再読み込み(_D)

source: File Has Changed on Disk
ja: ファイルがディスク上で変更されました

source: The file has been changed by another program.
ja: 他のプログラムによってファイルが変更されました。

source: File Contains Encoding Errors
ja: ファイルにエンコーディングエラーが含まれています

source: The encoding used to load the file detected errors. You may select an alternate encoding from the statusbar and reload.
ja: ファイルの読み込みに使用されたエンコーディングでエラーが検出されました。ステータスバーから別のエンコーディングを選択して再読み込みしてください。

source: Could Not Open File
ja: ファイルを開けませんでした

source: You do not have permission to open the file.
ja: ファイルを開く権限がありません。

source: _Retry
ja: 再試行(_R)

source: Open As _Administrator
ja: 管理者として開く(_A)

source: Document Restored
ja: ドキュメントが復元されました

source: Unsaved document has been restored.
ja: 未保存のドキュメントが復元されました。

source: _Discard…
ja: 破棄(_D)…

source: Print failed: %s
ja: 印刷に失敗しました: %s
ru: Ошибка печати: %s

source: Failed to format selection: %s
ja: 選択範囲のフォーマットに失敗しました: %s

source: Save File
ja: ファイルを保存
ru: Сохранить файл

source: Replace
ja: 置換

source: Move to previous match (Ctrl+Shift+G)
ja: 前の一致へ移動 (Ctrl+Shift+G)

source: Move to next match (Ctrl+G)
ja: 次の一致へ移動 (Ctrl+G)

source: Search & Replace (Ctrl+H)
ja: 検索と置換 (Ctrl+H)

source: Close search
ja: 検索を閉じる

source: _Replace
ja: 置換(_R)
ru: Заме_нить

source: Replace _All
ja: すべて置換(_A)
ru: Заменить _все

source: Use Re_gular Expressions
ja: 正規表現を使用(_G)

source: _Case Sensitive
ja: 大文字小文字を区別(_C)

source: Match Whole Words
ja: 単語単位で一致

source: Language
ja: 言語
ru: Язык

source: Search (Ctrl+Enter)
ja: 検索 (Ctrl+Enter)

source: Toggle Bottom Panel (Ctrl+F9)
ja: 下部パネルを切り替える(Ctrl+F9)

source: Failed to open file: %s
ja: ファイルを開くのに失敗しました: %s

source: Failed to initialize build pipeline: %s
ja: ビルドパイプラインの初期化に失敗しました: %s
ru: Не удалось инициализировать конвейер сборки: %s

source: Failed to get device information: %s
ja: デバイス情報の取得に失敗しました: %s
ru: Не удалось получить информацию об устройстве: %s

source: Active Configuration
ja: アクティブな構成

source: Configuration %s changed
ja: 構成 %s が変更されました

source: Failed to locate build configuration “%s”. It may be invalid or incorrectly formatted.
ja: ビルド構成 “%s” が見つかりませんでした。無効であるか、書式が正しくない可能性があります。

source: Active configuration set to “%s”
ja: アクティブな構成が “%s” に設定されました

source: Discovered device “%s”
ja: デバイス “%s” が検出されました
ru: Найдено устройство «%s»

source: Devices
ja: デバイス
ru: Устройства

source: Device set to %s
ja: デバイスが「%s」に設定されました

source: Cannot deploy to device, build pipeline is not initialized
ja: デバイスにデプロイできません。ビルドパイプラインが初期化されていません
ru: Развёртывание на устройство невозможно: конвейер сборки не инициализирован

source: Fallback
ja: フォールバック
ru: Резервная

source: My Computer (%s)
ja: マイコンピューター (%s)
ru: Мой компьютер (%s)

source: My Computer (%s) — %s
ja: マイコンピューター (%s) — %s
ru: Мой компьютер (%s) — %s

source: Cannot build transfer while on metered connection
ja: 従量課金制接続では、ビルド転送を実行できません
ru: Передача отключена на лимитном соединении

source: The build pipeline is in a failed state
ja: ビルドパイプラインは失敗状態にあります
ru: Конвейер сборки находится в состоянии неудачи

source: The build configuration has errors
ja: ビルド構成にエラーがあります
ru: Конфигурация сборки имеет ошибки

source: Pipeline started to clean build tree
ja: ビルドパイプラインがビルドツリーのクリーニングを開始しました

source: Pipeline started
ja: パイプラインが開始されました

source: Pipeline finished
ja: パイプラインが終了しました

source: Build (%s)
ja: ビルド (%s)

source: Post-install (%s)
ja: インストール後 (%s)

source: Pseudo terminal creation failed. Terminal features will be limited.
ja: 擬似端末の作成に失敗しました。端末機能は制限されます。
ru: Ошибка создания псевдо-терминала. Возможности терминала будут ограничены.

source: Cleaning…
ja: クリーニング中…
ru: Очистка…

source: Failed
ja: 失敗
ru: Неудачно

source: Ready
ja: 準備完了
ru: Готово

source: Downloading…
ja: ダウンロード中…
ru: Скачивание…

source: Building dependencies…
ja: 依存関係をビルド中…
ru: Построение зависимостей…

source: Bootstrapping…
ja: ブートストラップ中…
ru: Начальная загрузка…

source: Configuring…
ja: 構成中…
ru: Настройка…

source: Building…
ja: ビルド中…
ru: Сборка…

source: Installing…
ja: インストール中…
ru: Установка…

source: Committing…
ja: コミット中…
ru: Создание коммита…

source: Exporting…
ja: エクスポート中…
ru: Экпорт…

source: Success
ja: 成功
ru: Успешно

source: Preparing…
ja: 準備中…
ru: Подготовка…

source: Removing %s
ja: ファイル「%s」を削除中

source: Removing build directories…
ja: ビルドディレクトリを削除中…

source: Untitled command
ja: 無題のコマンド

source: Unit Test
ja: ユニットテスト

source: User requested run tool “%s”
ja: ユーザーが実行ツール “%s” をリクエストしました

source: Cannot run target, another target is running
ja: ターゲットを実行できません。別のターゲットが実行中です
ru: Не удается выполнить цель, выполняется другая цель

source: Application exited with error: %s
ja: アプリケーションがエラーにより終了しました: %s

source: Application exited
ja: アプリケーションが終了しました

source: Running %s…
ja: %s を実行中…
ru: Выполнение %s…

source: Deploying to device…
ja: デバイスにデプロイ中…
