Repository: GNOME/gnome-builder
Catalog: po/*.po
Languages: ja, ru

# shortcut window
source: Switch to the previous document
ru: Перейти к предыдущему документу

# shortcut window
source: Show list of open documents
ru: Показать список открытых документов

# shortcut window
source: Show document outline or symbol tree
ru: Показать структуру документа или дерево символов

# shortcut window
source: Find and replace
ru: Найти и заменить

# shortcut window
source: Goto Line
ru: Перейти к строке

# shortcut window
source: Find
ru: Найти

# shortcut window
source: Find the next match
ru: Найти следующее совпадение

# shortcut window
source: Find the previous match
ru: Найти предыдущее совпадение

# shortcut window
source: Clear highlight
ru: Очистить подсветку

# shortcut window
source: Copy and Paste
ru: Копировать и вставить

# shortcut window
source: Copy selected text to clipboard
ru: Копировать выделенный текст в буфер

# shortcut window
source: Cut selected text to clipboard
ru: Вырезать выделенный текст в буфер

# shortcut window
source: Paste text from clipboard
ru: Вставить текст из буфера

# shortcut window
source: Duplicate current line or selection
ru: Дублировать текущую строку или выделенное

# shortcut window
source: Undo and Redo
ru: Отменить и вернуть

# shortcut window
source: Undo previous command
ru: Отменить предыдущую команду

# shortcut window
source: Redo previous command
ru: Вернуть предыдущую команду

# shortcut window
source: Zoom
ru: Масштаб

# shortcut window
source: Zoom In
ru: Увеличить

# shortcut window
source: Zoom Out
ru: Уменьшить

# shortcut window
source: Reset Zoom
ru: Сбросить

# shortcut window
source: Editing
ru: Редактирование

# shortcut window
source: Increment number at cursor
ru: Увеличить число рядом с курсором

# shortcut window
source: Decrement number at cursor
ru: Уменьшить число рядом с курсором

# shortcut window
source: Join selected lines
ru: Объединить выбранные строки

# shortcut window
source: Sort selected lines
ru: Сортировать выбранные строки

# shortcut window
source: Make selection upper case
ru: Сделать выделенные символы заглавными

# shortcut window
source: Make selection lower case
ru: Сделать выделенные символы строчными

# shortcut window
source: Invert selection case
ru: Инвертировать регистр выделенного

# shortcut window
source: Show completion window
ru: Показать окно автодополнения

# shortcut window
source: Toggle opacity of completion window
ru: Переключить прозрачность окна автодополнений

# shortcut window
source: Toggle overwrite
ru: Переключить замену

# shortcut window
source: Reindent line
ru: Линия отступа

# shortcut window
source: Delete line
ru: Удалить строку

# shortcut window
source: Rename symbol
ru: Переименовать символ

# shortcut window
source: Requires semantic language support
ru: Требуется поддержка семантического языка

# shortcut window
source: Comment code
ru: Закомментировать

# shortcut window
source: Uncomment code
ru: Раскомментировать

# shortcut window
source: Beautify selected code
ru: Украсить выделенный код

# shortcut window
source: (LSP only) Format selected code or whole document
ru: (только LSP) Форматировать выделенный код или весь документ

# shortcut window
source: Navigation
ru: Навигация

# shortcut window
source: Move to next error in file
ru: Перейти к следующей ошибке в файле

# shortcut window
source: Move to previous error in file
ru: Перейти к предыдущей ошибке в файле

# shortcut window
source: Move to previous edit location
ru: Перейти к предыдущему месту редактирования

# shortcut window
source: Move to next edit location
ru: Перейти к следующему месту редактирования

# shortcut window
source: Jump to definition of symbol
ru: Перейти к определению символа

# shortcut window
source: Find references
ru: Поиск параметров

# shortcut window
source: Move viewport up within the file
ru: Переместить окно просмотра вверх

# shortcut window
source: Move viewport down within the file
ru: Переместить окно просмотра вниз

# shortcut window
source: Move viewport to end of file
ru: Переместить окно просмотра в конец файла

# shortcut window
source: Move viewport to beginning of file
ru: Переместить окно просмотра в начало файла

# shortcut window
source: Move to matching bracket
ru: Перейти к открывающей / закрывающей скобке

# shortcut window
source: Selections
ru: Выбор

# shortcut window
source: Select all
ru: Выделить все

# shortcut window
source: Unselect all
ru: Снять выделенное

# shortcut window
source: Build and Run
ru: Собрать и запустить

# shortcut window
source: Build
ru: Собрать

# shortcut window
source: Rebuild
ru: Пересобрать

# shortcut window
source: Run
ru: Запустить

# shortcut window
source: Profile
ru: Профиль

# shortcut window
source: Terminal Shortcuts
ru: Комбинации клавиш терминала

# shortcut window
source: Search
ru: Поиск

# shortcut window
source: Find text within terminal
ru: Поиск текста в терминале

source: _Find references
ru: Найти упоминания

source: _Undo
ru: Отме_нить

source: _Redo
ru: Верн_уть

source: C_ut
ru: _Вырезать

source: _Delete
ru: У_далить

source: _Highlighting
ru: _Подсветка

source: _Zoom
ru: _Масштаб

source: Zoom _In
ru: У_величить

source: Zoom _Out
ru: У_меньшить

source: _Reset
ru: _Сброс

source: Insert “%s”
ru: Вставить «%s»

source: Replace “%s” with “%s”
ru: Заменить «%s» на «%s»

source: Apply Fix-It
ru: Применить «Fix-It»

source: Rename symbol
ru: Переименовать символ

source: <b>%s</b> — <small>Line %u, Column %u</small>
ru: <b>%s</b> — <small>строка %u, столбец %u</small>

source: No references were found
ru: Ссылки не найдены

source: _Copy Link Address
ru: _Копировать адрес ссылки

source: Requested runtime is not installed
ru: Запрошенная среда выполнения не установлена

source: Failed to create shell within runtime “%s”
ru: Не удалось создать оболочку командной строки в среде выполнения «%s»

source: Regex
ru: Регулярное выражение

source: Match whole word
ru: По слову целиком

source: (Empty)
ru: (Пусто)

source: Beautifier plugin: error copying the gresource config file for “%s”: %s
ru: Подключаемый модуль украшения: не удалось скопировать файл конфигурации gresource для «%s»: «%s»

source: Beautifier plugin: error creating temporary config file for “%s”
ru: Подключаемый модуль украшения: не удалось создать временный файл конфигурации для «%s»

source: Beautifier plugin: Can’t read .ini file: %s
ru: Подключаемый модуль украшения: не удалось прочитать файл .ini: %s

source: Beautifier plugin: neither command nor command-pattern keys found: entry “%s” disabled
ru: Подключаемый модуль украшения: не найден ни ключ команды, ни шаблона команды: запись «%s» отключена

source: Beautifier plugin: both command and command-pattern keys found: entry “%s” disabled
ru: Подключаемый модуль украшения: найден ключ и команды, и шаблона команды: запись «%s» отключена

source: Beautifier plugin: config path “%s” does not exist, entry “%s” disabled
ru: Подключаемый модуль украшения: путь к конфигурационному файлу «%s» не существует, запись «%s» отключена

source: Beautifier plugin: command key out of possible values: entry “%s” disabled
ru: Подключаемый модуль украшения: шаблон команды не является одним из допустимых значений: запись «%s» отключена

source: Beautifier plugin: @c@ in “%s” command-pattern key but no config file set: entry “%s” disabled
ru: Подключаемый модуль украшения: присутствует @c@ в шаблоне команды «%s», но конфигурационный файл не задан: запись «%s» отключена

source: Beautifier plugin: can’t create temporary file for “%s”: entry “%s” disabled
ru: Подключаемый модуль украшения: невозможно создать временный файл для «%s»: запись «%s» отключена

source: Beautifier plugin: “%s”
ru: Подключаемый модуль для украшения: «%s»

source: Beautifier plugin: %s
ru: Подключаемый модуль украшения: %s

source: Beautifier plugin: can’t read the following resource file: “%s”
ru: Подключаемый модуль украшения: ошибка чтения файла ресурсов: «%s»

source: beautifier program missing, you must install it:
ru: программа beautifier отсутствует, её необходимо установить:

source: Beautifier Plugin: the view is not a GtkSourceView
ru: Подключаемый модуль украшения: вид не является подтипом GtkSourceView

source: Beautifier Plugin: no default beautifier found
ru: Подключаемый модуль украшения: не найдена стандартная программа для украшения

source: Beautifier Plugin: the buffer is not writable
ru: Подключаемый модуль украшения: буфер не доступен для записи

source: Beautifier Plugin: Nothing selected
ru: Подключаемый модуль украшения: выделение пусто

source: No beautifier available for “%s”
ru: Нет доступных украшений для «%s»

source: No beautifier available
ru: Нет доступных украшений

source: Editing
ru: Редактирование

source: Beautify the code
ru: Украсить код

source: Trigger the default entry
ru: Активировать запись по умолчанию

source: Beautifier plugin: no valid entries, disabling: %s
ru: Подключаемый модуль украшения: нет действительных записей, отключение: %s

source: Beautifier plugin: blocked attempt to remove a file outside of the “%s” temporary directory: “%s”
ru: Подключаемый модуль украшения: попытка удаления файла «%2$s» вне временной директории «%1$s» заблокирована

source: Beautifier plugin: command error output: %s
ru: Подключаемый модуль украшения: ошибка выполнения команды: %s

source: Beautifier plugin: the command output is empty
ru: Подключаемый модуль украшения: вывод команды пустой

source: Beautify plugin: the output is not a valid UTF-8 text
ru: Подключаемый модуль украшения: вывод не является действительным текстом в кодировке UTF-8

source: _Beautify
ru: _Украсить

source: No build configuration
ru: Нет конфигурации сборки

source: Select a build configuration from the sidebar to modify.
ru: Выберите конфигурацию сборки для редактирования из боковой панели.

source: Build Configurations
ru: Конфигурации сборки

source: All Runtimes
ru: Все окружения

source: Make _Active
ru: Активировать

source: Select this configuration as the active configuration.
ru: Выбрать эту конфигурацию как активную.

source: _Duplicate
ru: _Создать копию

source: Duplicating the configuration allows making changes without modifying this configuration.
ru: Дублирование конфигурации позволяет вносить изменения, не меняя эту конфигурацию.

source: _Remove
ru: _Удалить

source: Removes the configuration and cannot be undone.
ru: Удаляет конфигурацию и не может быть отменено.

source: Runtime Environment
ru: Среда выполнения

source: Install Prefix
ru: Префикс установки

source: Application Runtime
ru: Окружение приложения

source: Build Toolchain
ru: Набор инструментов сборки

source: _Save
ru: _Сохранить

source: Update project dependencies
ru: Обновить зависимости проекта

source: Configure build preferences
ru: Параметры сборки

source: View build console contents
ru: Просмотреть содержимое терминала сборки

source: _Export Bundle
ru: _Экспортировать пакет

source: Build Details
ru: Подробности сборки

source: Build pipeline is empty
ru: Конвейер сборки пустой

source: Build Targets
ru: Цели сборки

source: Build Preferences
ru: Параметры сборки

source: R_ebuild
ru: Пе_ресобрать

source: _Run
ru: _Запустить

source: R_un With…
ru: Запустить с _помощью…

source: Show errors and warnings provided by Clang
ru: Показывать ошибки и предупреждения предоставленные Clang

source: clang diagnostics warnings errors
ru: clang диагностика предупреждения ошибки

source: Suggest completions using Clang
ru: Предлагать автодополнения, используя Clang

source: Use Clang to suggest completions for C and C++ languages
ru: Предлагать автодополнения для языков C и C++ используя Clang

source: Clang Options
ru: Параметры Clang

source: Complete Parenthesis
ru: Автодополнение круглых скобок

source: Include parenthesis when completing clang proposals
ru: Включать круглые скобки при автодополнении предложений clang

source: Include parameters and types when completing clang proposals
ru: Включать аргументы и типы при автодополнении предложений clang

source: PROJECT_FILE
ru: ФАЙЛ_ПРОЕКТА

source: Colors
ru: Цвета

source: Palette name
ru: Имя палитры

source: Enter a new name for the palette
ru: Введите новое имя палитры

source: Save changes to palette “%s” before closing?
ru: Сохранить изменения в палитре «%s» перед закрытием?

source: Close without Saving
ru: Закрыть без сохранения

source: Save As…
ru: Сохранить как…

source: Load palette
ru: Загрузить палитру

source: Save palette
ru: Сохранить палитру

source: All files
ru: Все файлы

source: All supported palettes formats
ru: Все поддерживаемые форматы палитр

source: GIMP palette
ru: Палитра GIMP

source: GNOME Builder palette
ru: Палитра GNOME Builder

source: HSV visibility
ru: Видимость HSV

source: If the HSV components are visible.
ru: Если компоненты HSV видимые.

source: LAB visibility
ru: Видимость LAB

source: If the LAB components are visible.
ru: Если компоненты LAB видимые.

source: RGB visibility
ru: Видимость RGB

source: If the RGB components are visible.
ru: Если компоненты RGB видимые.

source: RGB unit
ru: Блок RGB

source: The unit used by RGB component and strings.
ru: Блок используемый рядами и компонентом RGB.

source: Selected palette ID
ru: Выбранный ID палитры

source: The selected palette ID among the loaded ones.
ru: Выбранный ID палитры среди загруженных.

source: Color strings visibility
ru: Видимость цветных строк

source: The visible color strings.
ru: Видимые цветные строки.

source: Color filter
ru: Цветовой фильтр

source: The filter used on the color scales and color plane.
ru: Фильтр, используемый в цветовых шкалах и цветовом уровне.

source: Color components
ru: Компоненты цвета

source: Visibility:
ru: Видимость:

source: Select the color spaces for which you want to see sliders in the panel.
ru: Выберите цветовое пространство, для которого хотите видеть ползунки на панели.

source: Hue Saturation Value
ru: Оттенок, Насыщенность, Значение

source: Red Green Blue
ru: Красный, Зелёный, Синий

source: Units:
ru: Элементы:

source: Select the type of unit you want to use for RGB components and strings in the panel.
ru: Выберите тип блока, который хотите использовать для рядов и компонентов RGB на панели.

source: Percent
ru: Проценты

source: Filters:
ru: Фильтры:

source: Select a filter that act on the colors or “None”.
ru: Выберите фильтр, действующий на цвета или «None».

source: Achromatopsia (monochromacy)
ru: Ахроматопсия (потеря восприятия цвета)

source: Achromatomaly (blue cone monochromacy)
ru: Ахроматомалия (потеря восприятия цвета синими колбочками)

source: Deuteranopia (green-blind)
ru: Дейтеранопия (слабое восприятие зелёного)

source: Deuteranomaly (green-weak)
ru: Дейтераномалия (слабое восприятие зелёного)

source: Protanopia (red-blind)
ru: Протанопия (нет восприятия красного)

source: Protanomaly (red-weak)
ru: Протаномалия (слабое восприятие красного)

source: Tritanopia (blue-blind)
ru: Тританопия (нет восприятия синего)

source: Tritanomaly (blue-weak)
ru: Тританомалия (слабое восприятие синего)

source: Websafe
ru: Безопасный для использования в сети

source: Select the color strings you want to see in the panel.
ru: Выберите цвета строк, которые хотите видеть на панели.

source: Palettes options
ru: Параметры палитр

source: Palette view mode:
ru: Режим просмотра палитры:

source: List
ru: Список

source: Swatches
ru: Образцы

source: Palette management
ru: Управление палитрой

source: Load
ru: Загрузить

source: From current document
ru: Из текущего документа

source: Select the palette you want to see in the panel or close one.
ru: Выберите палитру, которую хотите видеть на панели или рядом с ней.

source: No loaded palettes
ru: Нет загруженных палитр

source: No selected palettes
ru: Нет выбранных палитр

source: Select a palette file
ru: Выберите файл палитры

source: Try loading or generating a palette using the menu
ru: Попробуйте загрузить или создать палитру с помощью меню

source: Highlight _colors
ru: Подсвечивать _цвета

source: Workspace Shortcuts
ru: Ярлыки рабочего пространства

source: Command Bar
ru: Панель команд

source: Show the workspace command bar
ru: Показать окно команд рабочего пространства

source: Comment the code
ru: Закомментировать код

source: Uncomment the code
ru: Раскомментировать код

source: _Comment code
ru: _Закомментировать

source: Unco_mment code
ru: _Раскомментировать

source: When saving a file Builder will automatically update copyright information for you
ru: При сохранении файла Builder автоматически обновит информацию об авторских правах

source: update copyright save
ru: обновлять авторские права сохранение копирайт

source: Characters were used which might cause technical issues as a project name
ru: Были использованы символы, которые могут вызывать технические проблемы при использовании их в названии проекта

source: Your project will be created within a new child directory.
ru: Ваш проект будет создан в новой дочерней папке.

source: Directory already exists with that name
ru: Директория с таким именем уже существует

source: Your project will be created within %s.
ru: Ваш проект будет создан в %s.

source: Application ID is not valid.
ru: ID приложения неправильный.

# title
source: Start New Project
ru: Начать новый проект

source: A failure occurred while initializing version control
ru: Произошел сбой при инициализации контроля версий

source: Unique name that is used for your project’s folder and other technical resources. Should be in lower case without spaces and may not start with a number.
ru: Уникальное имя, которое используется для директории вашего проекта и других технических ресурсов. Должно быть в нижнем регистре без пробелов и не может начинаться с цифры.

source: The Application ID is a reverse domain-name identifier used to uniquely identify your application such as “org.gnome.Builder” and may not contain dashes.
ru: Идентификатор приложения — это обратный идентификатор доменного имени, который используется для уникальной идентификации вашего приложения, например «org.gnome.Builder», и не может содержать дефисов.

source: Project Location
ru: Расположение проекта

source: Select Project Directory
ru: Выберите директорию проекта

source: No license
ru: Без лицензии

source: Uses the Git version control system
ru: Использовать систему контроля версий Git

source: _Create Project
ru: _Создать проект

source: Select a Template
ru: Выбрать шаблон

source: Start _New Project…
ru: Начать_новый проект

source: _Start New Project…
ru: _Начать новый проект…

source: Suggest completions using Ctags
ru: Предлагать автодополнения используя Ctags

source: Use Ctags to suggest completions for a variety of languages
ru: Предлагать автодополнения для ряда языков, используя Ctags

source: Run with _Debugger
ru: Запустить с помощью _отладчика

source: Interrupt the program
ru: Прервать программу

source: Continue running the program
ru: Продолжить работу программы

source: Failed to start the debugger
ru: Не удалось запустить отладчик

source: Devhelp
ru: Справка разработчика

source: _Select Documentation…
ru: Выбрать _документацию…

source: Reveal search bar with Ctrl+F
ru: Показать строку поиска с помощью Ctrl+F

source: Previous search result (Ctrl+Shift+G)
ru: Предыдущий результат поиска (Ctrl+Shift+G)

source: Next search result (Ctrl+G)
ru: Следующий результат поиска (Ctrl+G)

source: Close search bar (Escape key)
ru: Закрыть панель поиска (клавиша Escape)

source: New _Documentation Page
ru: Новая _страницы документации

source: Display D-Bus inspector
ru: Показать инспектор D-Bus

source: Connected to “%s”
ru: Подключено к «%s»

source: Session
ru: Сессия

source: Execute
ru: Выполнить

source: Object Path
ru: Путь объекта

source: Method
ru: Метод

source: Result
ru: Результат

source: Elapsed Time
ru: Прошедшее время

source: Bus Address
ru: Адрес шины

source: Owner
ru: Владелец

source: Process ID
ru: ID процесса

source: Activatable
ru: Активизируемый

source: Yes
ru: Да

source: No
ru: Нет

source: PID
ru: ID процесса

source: read/write
ru: чтение/запись

source: write-only
ru: только для записи

source: read-only
ru: только для чтения

source: Interfaces
ru: Интерфейсы

source: Methods
ru: Методы

source: Properties
ru: Свойства

source: Signals
ru: Сигналы

source: Array of [%s]
ru: Массив [%s]

source: Access Denied by Peer
ru: Доступ запрещён клиентом

source: Authentication Failed
ru: Аутентификация прошла неудачно

source: Operation Timed Out
ru: Время выполнения операции истекло

source: Lost Connection to Bus
ru: Подключение к шине утеряно

source: D-Bus Connection Failed
ru: Не удалось подключиться к D-Bus

source: Connect
ru: Подключиться

source: Provide the address of the message bus
ru: Введите адрес шины обмена сообщениями

source: Connect to Other Bus
ru: Подключиться к другой шине

source: Search Bus Names
ru: Поиск по именам шин

source: Bus Names
ru: Имена шин

source: Select a Bus Name
ru: Выберите имя шины

source: Select a bus name to introspect the peer.
ru: Выберите имя шины, чтобы просмотреть клиента.

source: There is a file with unsaved changes. Save changes before closing?
ru: Есть файл с несохранёнными изменениями. Сохранить изменения перед закрытием?

source: Select the files to save:
ru: Выберите файлы для сохранения:

source: If you close without saving, all your changes will be permanently lost.
ru: Если вы закроете без изменений, все ваши изменения будут утеряны навсегда.

source: Provide a number between 1 and %u
ru: Введите число между 1 и %u

source: Go to line number
ru: Перейти по номеру строки

source: _Go
ru: _Переход

source: Close Frame
ru: Закрыть рамку

source: Open in New Workspace
ru: Открыть в новом рабочем пространстве

source: Emulates the Emacs text editor
ru: Эмулирует текстовый редактор Emacs

source: Enable the use of ESLint, which may execute code in your project
ru: Включить использование ESLint, для возможности выполнения кода в вашем проекте

source: eslint javascript lint code execute execution
ru: eslint javascript lint код выполнить выполнение

source: Enable ESLint
ru: Включить ESLint

source: Enable the use of eslint to find additional diagnostics in JavaScript files. This may result in the execution of code in your project.
ru: Включить использование eslint, чтобы найти дополнительную диагностическую информацию в файлах JavaScript. Это может привести к выполнению кода в вашем проекте.

source: Cloning project %s
ru: Клонирование проекта %s

source: Downloading application sources…
ru: Загрузка источников приложения…

source: The operation has been canceled
ru: Операция была отменена

source: Select Widget…
ru: Выбрать виджет…

source: _Select Widget…
ru: _Выбрать виджет…

source: _View Design
ru: _Показать дизайн

source: Switch to UI designer
ru: Переключиться на дизайнер пользовательских интерфейсов

source: _View Source
ru: _Показать исходник

source: Switch to source code editor
ru: Переключиться в редактор исходного кода

source: Failed to save glade document: %s
ru: Не удалось сохранить документ glade: %s

source: Glade shortcuts
ru: Комбинации клавиш Glade

source: Designer
ru: Дизайнер пользовательских интерфейсов

source: Save the interface design
ru: Сохранить дизайн интерфейса

source: Preview the interface design
ru: Предпросмотр дизайна интерфейса

source: Undo the last command
ru: Отменить предыдущую команду

source: Redo the next command
ru: Вернуть предыдущую команду

source: Switch to selection mode
ru: Перейти к режиму выделения

source: Switch to drag-resize mode
ru: Переключиться на режим перемещения и изменения размера

source: Switch to margin editor
ru: Перейти к редактору полей

source: Switch to alignment editor
ru: Перейти к редактору выравнивания

source: Unnamed Glade project
ru: Безымянный проект Glade

source: Unnamed Glade Project
ru: Безымянный проект Glade

source: Widget specific properties
ru: Свойства, специфические для виджета

source: Container child properties
ru: Свойства дочерних контейнеров
